:title: About
if you are reading this, you are reading the vemf documentation. the vemf documentation has information about all of the different characters, verbs, nouns and adverbs that vemf has.
this documentation can be enjoyed in a ||"raw" text format@https://github.com/selaere/vemf/blob/main/doc/raw.txt|| or in a ||nice html webpage format@https://selaere.github.io/vemf/doc/docs.html||. the raw format is converted to html with ||a vemf script@https://github.com/selaere/vemf/blob/main/doc/gen.vemf||.
but not only does this documentation have text. in fact i am bad at explaining stuff, so there are way more examples than text. here's one!
> "hello world i am a vemf test"\"aeiou" â‰¡ "hll wrld  m  vmf tst"
the vemf documentation is not only a documentation, it doubles as a test suite! when the tests are run, the expressions to both sides of the ` â‰¡ ` are evaluated, and checked for equality. if you see an example like this:
> 1+1 â‰¡ 2
you know it will work in the latest vemf version!
the main way to play around with vemf is the interactive repl.
>     1+1
> 2
>     __*3
> 6
the indented lines are input, and the result is unindented and ||formatted@#Format|| automatically. the default formatting is not always what you want though:
>     "hello world i am a vemf test"\"aeiou"
> (104 108 108 32 119 114 108 100 32 32 109 32 32 118 109 102 32 116 115 116)
in the repl, you can format it into a string by using `)4 ` (see ||Format||)
>     )4 "hello world i am a vemf test"\"aeiou"
> "hll wrld  m  vmf tst"
if you evaluate something like "tangent of pi radians", thanks to floating-point shenanigans, you can get small inaccuracies:
>     Ï€Ã¢
> -0.00000000000000012246467991473532
when testing those we use ` Â± ` ||Approximate Equal||, and if a test passes, the results are within about 10 significant figures.
> Ï€Ã¢ Â± 0
not everything can be automatically tested. functions that rely on the random number generator, like `Ã¡Ã Ã¥`, won't give the same results everytime, so tests with `?â‰¡` are ignored.
> 5Ã¡ ?â‰¡ 3
---
:title: Basics
here's a vemf expression!
> 1+2 â‰¡ 3
surprising! vemf can do maths. there are more operations, of course,
> 3*2 â‰¡ 6
> 8/4 â‰¡ 2
> 2*3+1 â‰¡ 7
characters like `+ - * /` are functions. here they take two arguments at each side: `Î±+Î²`.
evaluation of functions is strictly left to right:
> 1+2*3 â‰¡ 9
functions may also be called with one argument (monadic) instead of two (dyadic), by only giving the left argument `Î±+`. here you can see `-` being called as `Î±-` ||Negate|| and `Î±-Î²` ||Subtract||:
> 3-1 â‰¡ 2
> 4+2- â‰¡ _6
> 4+2-- â‰¡ 6
> 5- â‰¡ _5
> 5--3 â‰¡ _8
, where `_5`, `_6`, `_8` are constants meaning âˆ’5, âˆ’6, âˆ’8 respectively.
almost every function has two different variants that do different things. even `+`! monadic `Î±+` ||Sum|| adds all the items in a list:
> 123+ â‰¡ 6
uh, hm. yes. this is not the number one hundred and twenty-three. consecutive values form a list, and `1`, `2`, `3` are values. the sum of all of those is 6.
if you do want the number 123, you can use ||Numeric Literal||s by prepending a `:` colon:
> :123+1 â‰¡ :124
> :12:33:-4+ â‰¡ :41
or even shorter (and more obscure), we can use a ||Character Literal|| with a backtick. `z` is the 123rd character in ||the codepage@#The Codepage||, so:
> `z+1 â‰¡ :123
note that whitespace matters when using numeric literals:
> :12 34+ â‰¡ :19
> :123 4+ â‰¡ :127
you may use parentheses to group expressions:
> 1+(2*3) â‰¡ 7
here, `2*3` is another expression that is executed before the outer one, and `(2*3)` is a single value.
the mathematical operations you are familiar with are here. arithmetic `+-*/`, `^` ||Exponent||, `âˆŸ` ||Logarithm||, and a bunch more.
---
:title: Lists
a list is a finite ordered collection of values. lists can be created with stranding syntax, which just means putting values next to each other:
>     123
> (1 2 3)
>     :16:25:36:49:64
> (16 25 36 49 64)
lists may be nested arbitrarily deep. this is a list composed of 3 lists, each with 3 items (or, if you prefer, a 3 by 3 matrix).
>     (123)(456)(789)
> ((1 2 3) (4 5 6) (7 8 9))
the arguments of a list dont have to have the same length or the same type:
>     (036)9 
> ((0 3 6) 9)
>     (98)(123)(4567)
> ((9 8) (1 2 3) (4 5 6 7))
we can get a list's length with `Î±~`:
> 123~ â‰¡ 3
in vemf, strings are lists of characters (rather, Unicode codepoints). a string literal makes a list with all the characters inside the ||Quotes||, in vemf's codepage:
> "abc" â‰¡ :97:98:99
> "â™¥â™¦â™£â™ " â‰¡ 3456
> "Hello, World!"~ â‰¡ :13
strings can be stranded as well:
>     "earth""fire""air""water"
> ((101 97 114 116 104) (102 105 114 101) (97 105 114) (119 97 116 101 114))
>     )4 "earth""fire""air""water"
> ("earth" "fire" "air" "water")
functions that work with numbers are scalar functions: they automatically distribute to every number in a list. for two lists, this pairs up the elements and operates on them:
> 012*345 â‰¡ 0 4 :10
if one argument is a list and another is a scalar, the scalar is 'distributed' to all the items in the array:
> 63102+2 â‰¡ 85324
> 1/234 â‰¡ (1/2)(1/3)(1/4)
these rules are applied recursively:
> (123)(456)(789)+01(323) â‰¡ (123)(567)(:10:10:12)
see also: ||Each||, ||Conform||
comparison functions, like `< = > â‰¤ ~ â‰¥` (`Î±~Î²` is ||Not Equals||), are scalar as well, and they return a 1 if true, otherwise 0:
> "cat"="cow" â‰¡ 100
> "cat"="cat" â‰¡ 111
> (0123)(456)(78)9>5 â‰¡ (0000)(001)(11)1
> "pickled peppers"~`p â‰¡ 011111110100111
though it's useful to compare if two lists are equal, so there is also `â‰¡` ||Matches|| and `â‰ˆ` ||Not Matches||
> "cat"â‰¡"cow" â‰¡ 0
> "cat"â‰¡"cat" â‰¡ 1
we've seen that characters are not a separate type, and they are just their codepoints. subtracting an ascii lowercase letter by 32 makes it uppercase, so we can make a word uppercase by:
> "screaming"-:32 â‰¡ "SCREAMING"
though there's also another function for this, `Ã‡` ||Uppercase||, and it leaves punctuation unchanged:
> "words words"Ã‡ â‰¡ "WORDS WORDS"
an element in a list can be indexed with `Î±@Î²` ||Index||, where indices start with 0:
> 2468@2 â‰¡ 6
> 2468@0 â‰¡ 2
> 2468@ â‰¡ 2 ' monadic @ is First
> (123)(456)(789)@2 â‰¡ 789
> (123)(456)(789)@21 â‰¡ 8
`Î±,Î²` ||Concatenate||s lists:
> 123,456 â‰¡ 123456
> 1,234 â‰¡ 1234
> (12)(34),56 â‰¡ (12)(34)56
and `Î±â™«Î²` creates a ||Pair||:
> 123â™«456 â‰¡ (123)(456)
`Î±â†•` ||Iota|| returns all the integers from 0 up to Î±:
> 5â†• â‰¡ 01234
if you want something more familiar, try `Î±â†¨` ||Inclusive Iota||:
> 5â†¨ â‰¡ 12345
all lists have a fill, usually `â– ` ||None||. you can think of the fill as a dummy element for the elements outside of its domain. when you index out of range, you will get the fill:
> 123@3 â‰¡ â– 
the default fill is ||None||. you can specify the fill of a list `Î±â–Î²` ||Set Fill||, and query it with `Î±â–` ||Get Fill||.
> 123â–0@3 â‰¡ 0
> 123â– â‰¡ â– 
> 123â–0â– â‰¡ 0
`Î±â†‘Î²` ||Take|| takes the first Î² items, and `Î±â™‚Î²` ||Drop|| returns everything but the first Î² items:
> "javascript"â†‘4 â‰¡ "java"
> "javascript"â™‚4 â‰¡ "script"
`â†“` ||Take Right|| and `â™€` ||Drop Right|| use the last items instead:
> "file.txt"â†“4 â‰¡ ".txt"
> "file.txt"â™€4 â‰¡ "file"
these use the fill when the list runs out:
> "js"â–` â†‘5 â‰¡ "js   "
> "js"â–` â†“5 â‰¡ "   js"
but `Î±Â¶Î²` ||Reshape|| starts taking from the start when it runs out of items:
> 123Â¶9 â‰¡ 123123123
> "sal"Â¶5 â‰¡ "salsa"
`â†‘`, `â†“` and `Â¶` with a list as a right argument can reshape, or create a nested list with those dimensions:
> 0123456789â†‘33 â‰¡ (012)(345)(678)
> 0123456789â†“33 â‰¡ (123)(456)(789)
> 1234Â¶43 â‰¡ (123)(412)(341)(234)
---
:title: Adverbs
adverbs are a syntax for functions that take other functions. take one of the most basic: ||Selfie|| `â”´G` takes a function `G` and returns a function that applies `G` with the same argument used twice:
> 123â”´+ â‰¡ 246
> 123â”´* â‰¡ 149
> "bee"â”´, â‰¡ "beebee"
> "bee"â”´â™« â‰¡ "bee""bee"
and if ||Swap|| `â”´G` is called with two arguments, it returns a functions that applies `G` with its arguments flipped:
> 6â”´-2 â‰¡ _4
> 4â”´/1 â‰¡ 1/4  ' reciprocal
there are two types of adverbs. 1-adverbs, like `â”´G` ||Selfie||/||Swap||, take one operand after them, and the whole acts as a verb. 2-adverbs, like `Fâ•‘G` ||Over||, take two operands at both sides. Over applies `G` to each argument, and then `F`:
> 4Â²â•‘+5 â‰¡ 4Â²+(5Â²)
> 4Â²â•‘â–² â‰¡ 4Â²â–²
adverb precedence is right-to-left.
> 4â”´Â²â•‘-5 â‰¡ 5Â²-(4Â²)
additionally, 1-adverbs can be used before 2-adverbs, and this applies them to the left operand:
> 4*â”´â•‘-5 â‰¡ 4(â”´*)â•‘-5
> 4*â”´â•‘-5 â‰¡ 4*4-(5*5)
the built-in adverbs are all box-drawing symbols (though not all box-drawing symbols are adverbs). 1-adverbs have a single vertical line and 2-adverbs have a double vertical lines:
> 1-adverbs: â•ªâ”¼â”´â”¬â•§â•¤â••â•’â•›â•˜â”â”Œ
> 2-adverbs: â•¬â•«â•¨â•¥â•©â•¦â•–â•“â•œâ•™â•—â•”â•‘
these adverbs have a variety of uses. some of them are ||Combinators||, like the ones that we've just seen, and they apply the operands in various ways. some are more interesting, though.
# Iteration
vemf automatically vectorizes, so often explicit loops are usually not necessary. however, some adverbs can be used to explicitly iterate in a certain way
`Î±â••G` ||Each|| applies G to every item in Î±:
> (123)(45)(6789)"aaaaaa"â••~ â‰¡ 3246
`Î±â••GÎ²` ||Each|| (dyadic) pairs the items up and applies G to each pair:
> 123â••,456 â‰¡ (14)(25)(36)
`Î±â•›GÎ²` ||Each Left|| and `Î±â•˜GÎ²` ||Each Right|| iterate through one argument, while passing the other argument:
> 123â•›,456 â‰¡ (1456)(2456)(3456)
> 123â•˜,456 â‰¡ (1234)(1235)(1236)
using both Each Left and Each Right we get something similar to APL's outer product, or a cartesian product:
> 123â•˜â•›,456 â‰¡ ((14)(24)(34))((15)(25)(35))((16)(26)(36))
> 123â•›â•˜,456 â‰¡ ((14)(15)(16))((24)(25)(26))((34)(35)(36))
`Î±â•§G` ||Reduce|| is like applying G between every element in Î±, progressively building up a value: 
> 2345â•§+ â‰¡ 2+3+4+5
this is similar to the monadic use of addition, `Î±+` ||Sum||. in fact, `*` `,` `&` `&#x7c;` `Ã±` `Ã‘` all act the same way: the monad is the reduction of the dyad.
`Î±â•¤G` ||Scan|| gives the intermediate results of the reduction:
> 2345â•¤+ â‰¡ (2)(2+3)(2+3+4)(2+3+4+5)
> 00100010011020â•¤+ â‰¡ 00111122234466
`Î±Fâ•¨G` ||Power|| calls G, `Î±F` times
> 14â•¨â”´â™« â‰¡ ( ((11)(11)) ((11)(11)) )( ((11)(11)) ((11)(11)) )
(note that `14` is not a strand, `4` is an operand of the 2-adverb, and `1` is an argument)
`Î±Fâ•©G` ||Until|| calls G until `Î±F` returns not 0.
# Combinators
combinators call their operands in different ways. they are one of the main ways functions are defined; combinators are the "glue" that joins different functions.
vemf has a lot of different combinators! here's a summary, using `+` `/` `*` as examples:
> NAME         : MONADIC, DYADIC
> atop      +/ : Î±+/    , Î±+Î²/
> swap      â”´/ : Î±/Î±    , Î²/Î±
> atleft   +â•œ/ : Î±+/    , Î±+/Î²
> atright  +â•™/ : Î±/     , Î±/(Î²+)
> over     +â•‘/ : Î±+/    , Î±+/(Î²+)
> onleft   +â•–/ : Î±+/Î±   , Î±+Î²/Î²
> onright  +â•“/ : Î±/(Î±+) , Î±/(Î±+Î²)
> fork    â””+/* : Î±+/(Î±*), Î±+Î²/(Î±*Î²)
there is also a ""3-adverb"" of sorts, the `â””FGH` ||Fork||. it works a little differently, it is a prefix rather than an infix, and is ocassionally useful. for instance, the average (mean) of a list is the sum divided by the length:
> 12345â””+/~ â‰¡ 3
the formula for triangular numbers is n(n+1)/2. we can do the first part as a fork:
> 6â””â—„*â–² â‰¡ :42
this is the same as
> 6â—„*(6â–²) â‰¡ :42
here, `â—„` is the identity function or ||Left||, that always returns the left argument. there is also a `â–º` ||Right||, that returns the right argument.
> 6â—„3 â‰¡ 6
> 6â–º3 â‰¡ 3
> 6*(6â–²) â‰¡ :42
and then we can do the halving with `Â½` ||Half||:
> 6â””â—„*â–²Â½ â‰¡ :21
as a general rule of thumb, when there is a `â—„` or `â–º` in a fork, it can be represented with one of the other combinators. here we can use `Î±Fâ•“G` ||On Right||, which evaluates to `Î±G(Î±F)`
> 6â–²â•“*Â½ â‰¡ :21
here is another way of representing all the combinators that i can test automatically
> â™«,;`(,`)â†’F â™«,;`[,`]â†’G â™«,;`{,`}â†’H â‰¡ â– 
> (`aâ”´G)   (`aâ”´G`b)    â‰¡ "[aa]"    "[ba]"
> (`aFâ•œG)  (`aFâ•œG`b)   â‰¡ "[(a)]"   "[(a)b]"
> (`aFâ•™G)  (`aFâ•™G`b)   â‰¡ "[a]"     "[a(b)]"
> (`aFâ•–G)  (`aFâ•–G`b)   â‰¡ "[(a)a]"  "[(ab)b]"
> (`aFâ•“G)  (`aFâ•“G`b)   â‰¡ "[a(a)]"  "[a(ab)]"
> (`aFâ•‘G)  (`aFâ•‘G`b)   â‰¡ "[(a)]"   "[(a)(b)]"
> (`aâ””FGH) (`aâ””FGH`b)  â‰¡ "[(a){a}]""[(ab){ab}]"
> (`aFâ•œHâ•™G)(`aFâ•œHâ•™G`b) â‰¡ "[(a)]"   "[(a){b}]"
---
:title: Variables
i will now introduce some terminology. functions, lists and numbers are types of values. in a program, these types can all be used as either nouns or verbs (what we've been calling "values" and "functions" up to now). a function may be used as a noun, and a verb may be used as a function.
a noun can become a verb if you enclose it in parentheses. this way, you can pass functions to other functions. `Î±$Î²` ||Call||s Î± with the pair of arguments Î²:
> (*)$35 â‰¡ :15
with built-in functions, you can also use a dot `.` before the name:
> .*$35 â‰¡ :15
you can also have functions in lists:
> .+.-.*./@3$62 â‰¡ 3
indexing a function calls it monadically with the index,
> .-@3 â‰¡ _3
and some list functions, like ||Take||, use this to treat functions as infinite lists:
> .â—„â†‘4 â‰¡ 0123
> .-â†‘33 â‰¡ (0_1_2)(_3_4_5)(_6_7_8)
> .+~ â‰¡ âˆž
characters from `a` to `z` are variables, which are given somewhat-convenient default values.
> abcdefghij â‰¡ :12:20:99:100:999:1000:10000:100000:1000000:10000000
> klmnopqrst â‰¡ :15:16:31:32:63:64:127:128:255:256
> uvwxyz     â‰¡ :512:1024:32768:65536:16777216:2147483648
> f+n â‰¡ :1032
variables can be set with `â†’name` and retrieved as a noun with `.name`. the dot is not necessary for variables `a` to `z`.
> :35/7â†’f 1/f â‰¡ :0.2
> :35/7â†’five 1/.five â‰¡ :0.2
built-in verbs are also variables, and that's why you can get them with a dot. `.` is the noun variable prefix, and `:` is the verb variable prefix:
> 4:*3 â‰¡ :12
that was useless. but this means you can assign functions and use them as verbs!
> *â†’mult 4:mult3 â‰¡ :12
> â””+/~â†’avg 234:avg â‰¡ 3
`A` to `Z` don't need the colon:
> *â†’M 4M3 â‰¡ :12
> â””+/~â†’V 234:avg â‰¡ 3
calling a number or a list as a verb just makes it return itself:
> :35/7â†’f 4:f â‰¡ :5
> :35/7â†’F 4F  â‰¡ :5
a name, or identifier, can be a sequence of lowercase letters (`mul`, `six`, `things`), an underscore followed by a character (`_Ã«`, `_1`) or a single character (`+`, `-`). any other name can be used by using quotes: `."Name of variable"`
`xâ†’name` is a statement that sets x to the variable `.name`. statements are not quite like verbs; you will see more about statements in the ||Statements|| section.
there is another kind of assignment: `â”€name` ||Set Function|| (that is a box drawing character, not a minus sign `-`). it is a verb that sets Î± to the variable and returns Î² or, if not given, Î±. this makes it flexible to define a variable and then use it.
> 4 â”€four 1+2+.four â‰¡ 7  ' Î² is 1, return 1 after changing the variable
> 4 â”€four +1+2      â‰¡ 7  ' Î² not given, return .four back
and for golfing purposes, the functions `A`..`Z` are set by default to `â”€a`..`â”€z`, so you can set and get variables conveniently.
> 3+1X+x â‰¡ 8
---
:title: Trains
we saw earlier that you can assign a verb to a variable with `â†’name`,
> +â†’add 4:add5 â‰¡ 9
and you can use a verb as a noun by enclosing it in parentheses (or, in general, having it at the start of an expression)
> (+)$12 â‰¡ 3
but by having more stuff inside the expression, we can modify the verb in certain ways:
a verb and a noun `FÎ²` is called a Bind. it calls F with Î² as a right argument, ignoring whatever was passed to the right.
> +1â†’inc 4:inc â‰¡ 5
> (+1)@5 â‰¡ 6
> *2â†’dup 4:dup â‰¡ 8
> *2â†’dup 4:dup9 â‰¡ 8
(note that `inc` and `dup` are equivalent to `Î±â–²` ||Bump Up|| and `Î±Â¼` ||Double||)
> +1â†’inc 4:inc â‰¡ 5
> *2â†’dup 4:dup â‰¡ 8
> *2â†’dup 4:dup9 â‰¡ 8
a verb and a verb `FG` is an Atop. it calls F with all arguments, and then calls G atop of that.
> â†¨*â†’fact 6:fact â‰¡ :720
> ~â†•â†’dom  "text":dom â‰¡ 0123
> |Â¬â†’nor  0:nor1 â‰¡ 0
(note that `fact`, `dom`, `nor` are equivalent to `Î±!` ||Factorial|| (for natural Î±), `Î±â™£` ||Domain|| and `Î±Ã¶Î²` ||Nor||)
verb+verb+noun `FGÎ²` is a mix of the two: it calls F with both arguments, and then calls G atop of that using Î² as a right argument.
> +/2â†’avg  4:avg8 â‰¡ 6
> Â²*Ï€â†’area 3:area â‰¡ 9*Ï€
(note that `Ï€` is pi, the number)
you can chain these, left-to-right
> +1+2+3â†’f 5:f â‰¡ :11
> ~=0â†’empty Ï†:empty â‰¡ 1
we've been setting these trains to variables before using them. it won't work if you try to apply them directly with parentheses:
> 5(+/2)9
is a list with `5`, the function `+/2` (as a noun) and `9`. you can turn a noun into a verb with ||Verbize|| `â”˜`:
> 5â”˜(+/2)9 â‰¡ 7
> 6â”˜(â†¨*) â‰¡ :720
but you never actually need to do this! an inlined train will always be shorter:
> 5+9/2 â‰¡ 7
> 6â†¨* â‰¡ :720
trains are also useful when used with adverbs:
> ' if length is 3, uppercase
> "and""the""small""bee""wanted""to""fly"â••(~=3)â•¨Ã‡ â‰¡ "AND""THE""small""BEE""wanted""to""FLY"
we can create a variable from the triangular number function from earlier with a train.
the `Â½` is applied atop the result of the fork, so as a single function this is an atop:
> 6â–²â•“*Â½ â‰¡ :21
> 6â”˜(â–²â•“*Â½) â‰¡ :21
note that we need the `â”˜` for it to be interpreted as a function.
we can set our function to a variable and use it.
> â–²â•“*Â½â†’triang 6:triang â‰¡ :21
this way of defining functions, stringing other functions together with combinatorsâ€” is an important part of vemf. you might hear it being called "tacit programming" or "point-free style". note how we never refer to our arguments by name. we can also define this function explicitly (see ||Statements||):
> {Î±*(Î±â–²)Â½}â†’triang 6:triang â‰¡ :21
> {Î±â–²*Î±Â½}â†’triang 6:triang â‰¡ :21  ' multiplication is commutative
but the tacit form is simpler (and shorter, and somewhat faster).
---
:title: Groups
i don't like parentheses. i don't like the fact that occasionally i have to use them to make things work. i don't like that precedence is a thing. but alas, this is not a stack language, and we ocassionally need to group things. but parentheses take up a lot of space, and something as simple as `+2` gains two characters when used with an adverb `(+2)â•œ/`. 
> 7 (+2)â•œ/ 3
precedence adjusting is annoying:
> :42â†’a "I think ",(aÂª)," is a good number." â‰¡ "I think 42 is a good number."
nested list literals can also get unwieldy:
> (123)(45)(6789)
the solution is group characters. group characters act like parentheses, but instead of terminating when the closing parenthesis is found, how much will be grouped depends the character you use. here are all the groupers:
> 2 3 4 5 6 7 8 9 10
> â”‚ â”œ â•ž â•Ÿ â•  â”¤ â•¡ â•¢ â•£
their basic function is grouping a number of nouns and verbs (or words) together. the number next to them specifies how many will be grouped. the 2-grouper `â”‚` will group 2 words:
> â”‚01â”‚23â”‚45 â‰¡ (01)(23)(45)
> â”‚012â”‚â”‚345â”‚67 â‰¡ (01)2((34)5)(67)
> â”œ123â”‚45â•ž6789 â‰¡ (123)(45)(6789)
> :42â†’a "I think ",â”‚aÂª," is a good number." â‰¡ "I think 42 is a good number."
there's a pattern to these: when they're pointing to the right the number of lines going out is the number of words grouped, and the symbols for 7, 8, 9, 10 groupers are flipped 3, 4, 5, 6 groupers.
we said that groupers are alternatives to parentheses. in an expression, there are a few places where it makes sense to stop the expression, or to place a closing parenthesis. for example, for the expression `1+2+3`
> (1)+2+3
> (1+)2+3
> (1+2)+3
> (1+2+)3
> (1+2+3)
are all expressions that make sense. if you represent the places where the parentheses can end with spaces: `1 + 2 + 3`
all that groupers do is pick which space to close with:
> â”‚1+2+3 â‰¡ (1 +)2 + 3
> â”œ1+2+3 â‰¡ (1 + 2)+ 3
> â•ž1+2+3 â‰¡ (1 + 2 +)3
> â•Ÿ1+2+3 â‰¡ (1 + 2 + 3)
groupers won't break into literals, parentheses, other groupers, or any other nested structure. `1+(2/3)-:3.14` is split like `1 + (2/3) - :3.14 Â²`:
> â”‚1+(2/3)-:3.14Â² â‰¡ (1 +)(2/3) - :3.14 Â²
> â”œ1+(2/3)-:3.14Â² â‰¡ (1 + (2/3))- :3.14 Â²
> â•ž1+(2/3)-:3.14Â² â‰¡ (1 + (2/3) -):3.14 Â²
> â•Ÿ1+(2/3)-:3.14Â² â‰¡ (1 + (2/3) - :3.14)Â²
a grouper can't break after an adverb, as adverbs always need a verb after them:
> â”‚aâ•’+b â‰¡ (aâ•’+)b
> â”‚aâ••â••(â™£â™ )b â‰¡ (aâ••â••(â™£â™ ))b
but it can break before a 2-adverb! this is actually really useful to adjust adverb precedence, as doing `(-â•–!)â•‘*` is different to `-â•–!â•‘*`
> a -â•–!â•‘*b â‰¡ a - â•–! â•‘* b
> aâ”‚-â•–!â•‘*b â‰¡ a(- â•–!)â•‘* b
groupers also can't break between the operands in a fork:
> Ï† â””+â•›+â••+â•‘- â‰¡ Ï† â””+â•›+â••+ â•‘-
> Ï†â”˜â””+â•›+â••+â•‘- â‰¡ Ï†(â””+â•›+â••+)â•‘-
(`â”˜` ||Verbize|| is also a 1-grouper. this is occasionally useful)
---
:title: Statements
there is a more explicit way of defining functions, and it looks more like lambda expressions you might be used to from other languages:
> 456{Î±+/(Î±~)} â‰¡ 5
> 345{Î²^(Î±â™£â™ )*Î±+}:10 â‰¡ :345
that thing inside braces is the ||function definition@#Define Function||, and it uses special variables like `Î±` or `Î²` that are always defined inside dfns. the expression inside the braces will be evaluated and returned.
but there's more that you can do inside functions. dfns are composed of multiple statements, and the result of the last one is returned.
statements are delimited by statement separators like `Â·` ||Discard|| or `â—˜` ||Return||. discard statements evaluate a value and discard it; return statements return a value from the function.
> â– {1Â·2Â·3â—˜4Â·5} â‰¡ 3
not very interesting. you have already seen one statement separator: `â†’name` assigns the body of the statement to the variable with that name. you can use this in longer pieces of code, to give names to values.
> 456{Î±+â†’avg Î±~â†’len .avg/.len} â‰¡ 5
functions create a lexical scope. this means variables you define inside of a function will not be accessible outside.
these become more useful when used with `x?y` ||Then|| (note that Then is not a function), which executes the following statement `y` if `x` is not 0. you can use these for ternary-operator-like things:
> _5{Î±>0?Î±â—˜Î±-} â‰¡ 5
the left side of `?` can take a function, and it will be called with the same arguments as the outer function:
> _5{>0?Î±â—˜Î±-} â‰¡ 5
you can also use statements in ||Blocks||, that work like functions that are immediately evaluated. this can be useful for conditions:
> [1+1=2?"good"â—˜"bad"] â‰¡ "good"
or for doing multiple things if a condition holds. blocks don't create their own scope, so:
> 6{Î±â†’a 4â†’b a>b?[a-bâ†’a 0â†’b]Â· ab} â‰¡ 20
---
:title: Programs
# The Codepage
here is the vemf codepage. if you are reading in a browser, you might be seeing this at the left of your screen.
>    | 0123456789abcdef0123456789abcdef
> ---+-----------------++++++++++++++++
> x0 | Â¤â˜ºâ˜»â™¥â™¦â™£â™ â€¢â—˜â—‹â—™â™‚â™€â™ªâ™«â˜¼â–ºâ—„â†•â€¼Â¶Â§â–¬â†¨â†‘â†“â†â†’âˆŸâ†”â–²â–¼
> x2 |  !"#$%&'()*+,-./0123456789:;<=>?
> x4 | @ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_
> x6 | `abcdefghijklmnopqrstuvwxyz{|}~âŒ‚
> x8 | Ã‡Ã¼Ã©Ã¢Ã¤Ã Ã¥Ã§ÃªÃ«Ã¨Ã¯Ã®Ã¬Ã„Ã…Ã‰Ã¦Ã†Ã´Ã¶Ã²Ã»Ã¹Ã¿Ã–ÃœÂ¢Â£Â¥â‚§Æ’
> xA | Ã¡Ã­Ã³ÃºÃ±Ã‘ÂªÂºÂ¿âŒÂ¬Â½Â¼Â¡Â«Â»â–‘â–’â–“â”‚â”¤â•¡â•¢â•–â••â•£â•‘â•—â•â•œâ•›â”
> xC | â””â”´â”¬â”œâ”€â”¼â•žâ•Ÿâ•šâ•”â•©â•¦â• â•â•¬â•§â•¨â•¤â•¥â•™â•˜â•’â•“â•«â•ªâ”˜â”Œâ–ˆâ–„â–Œâ–â–€
> xE | Î±Î²Î“Ï€Î£ÏƒÎ¼Ï„Î¦Î˜Î©Î´âˆžÏ†Îµâˆ©â‰¡Â±â‰¥â‰¤âŒ âŒ¡Ã·â‰ˆÂ°Â¨Â·âˆšâ¿Â²â– âŽ•
this is based on the ||CP-437@https://en.wikipedia.org/wiki/Code_page_437|| codepage. this is the codepage used in the very first IBM PCs! note that
- `â—™ 0A` doubles as a ||Line Break||, it is whitespace
- `  20` is a space
- `Â¨ F9` represents `Â¨ U+00A8 DIAERESIS`, while CP-437 uses a small middle dot. it is encoded in Unicode as `âˆ™ U+2219 BULLET OPERATOR`, but most modern fonts don't make the distinction with `Â· FA` or `â€¢ F7`. (the related codepage ||CP-850@https://en.wikipedia.org/wiki/Code_page_850|| does this too)
- `Â¤ 00` and `âŽ• FF` are control characters in CP-437. they are assigned other characters in vemf (`Â¤ U+00A4 CURRENCY SIGN` and `âŽ• U+2395 APL FUNCTIONAL SYMBOL QUAD` respectively) but (for now) they are syntax errors outside of literals
these are all of the symbols available to vemf programs. vemf files can be encoded in Unicode (UTF-8) or the vemf codepage byte-by-byte.
some confusable characters are translated to the codepage:
- U+2212 MINUS SIGN `âˆ’` and U+2013 EN DASH `â€“` to hyphens `-` (0x2D)
- U+23AE INTEGRAL EXTENSION `âŽ®` to box-drawing character `â”‚` (0xB3)
- U+237A APL FUNCTIONAL SYMBOL ALPHA `âº` to alpha `Î±` (0xE0)
- U+00DF LATIN SMALL LETTER SHARP S `ÃŸ` to beta `Î²` (0xE1)
- U+2211 N-ARY SUMMATION `âˆ‘` to uppercase sigma `Î£` (0xE4)
- U+00B5 MICRO SIGN `Âµ` to mu `Î¼` (0xE6)
- U+2126 OHM SIGN `â„¦` to uppercase omega `Î©` (0xEA)
- U+00F0 LATIN SMALL LETTER ETH `Ã°` to delta `Î´` (0xEB)
- U+03D5 GREEK PHI SYMBOL `Ï•` and U+0278 LATIN SMALL LETTER PHI `É¸` to phi (0xED)
- U+025B LATIN SMALL LETTER OPEN E `É›` to epsilon `Îµ` (0xEE)
- U+2219 BULLET OPERATOR `âˆ™` to diaereses `Â¨` (0xF9)
- control characters 0x00-0x1F are converted literally
if a character is not in the codepage or in this list, it will be implicitly converted into a ||Unicode Escape||.
# Execution
a vemf file is a list of statements that are executed in order. there are only a few ways a vemf program can contact with the outside world
the command line arguments are available as `Î´` ||Arguments||. as a shorthand, `Î±` ||Alpha|| and `Î²` ||Beta|| are set to the first argument and second argument respectively, and `Î£` ||Arity|| is the number of arguments. arguments are always Unicode strings.
the return value of the program (either from a `â—˜` ||Return|| in the top scope or the last statement in the program) is, by default, formatted and printed automatically. the formatting is the same as `â¿0` (see ||Format||):
- if the result is a function, it is called with the arguments passed into the program (monadically with Î± if only one argument was passed, otherwise with Î± and Î²), and then formatted
- if the result is a scalar, it is printed as a number in decimal
- if the result is a flat list, it is printed as a Unicode string, where every element is a codepoint
- if the result is a nested list, each of the inner lists will be printed as a separate line and delimited with newlines
there are also input and output streams. there can be any number, but the cli uses input stream 0 for stdin, output stream 0 for stdout, and output stream 1 for stderr. `â˜º` ||Print|| and `â˜»` ||Print Line|| always print text to output stream 0.
the streams are byte streams, and the functions `Ã–` ||Write|| and `Ãœ` ||Read|| convert to/from UTF-8. you may use `_Ã–` ||Write Bytes|| and `_Ãœ` ||Read Bytes|| to manipulate the byte streams directly.
you also have access to a global random number generator (see `Ã¡` ||Pick||, `Ã¢` ||Sample||, `Ã¥` ||Choice||)
---
:char: â˜º
:ascii: 'pr
:type: verb
#1 Print
print Î± to standard output
> "Hello, "â˜ºÂ·"World!â—™"â˜º
see also: ||Print Line||
#2 Print
print Î± to standard output, and return Î²
> "Hello, "â˜º"World!â—™"â˜º
---
:char: â˜»
:ascii: '# 'pl
:type: verb
#1 Print Line
print Î± to standard output, with a training newline (0x0A)
> "Hello, World!"â˜»
see also: ||Print||, ||Write||
#2 Print Line
print Î± and return Î²
> "Calculating the square root of two..."â˜»2âˆš â‰¡ :1.4142135623730951
#_12 Print Formatted
prints `Î±â¿` or `Î±â¿Î²` and returns Î± unchanged. useful when debugging trains. equivalent to `â¿â•–â˜»`
---
:char: â™¥
:ascii: 'cx
:type: verb
#1 Pairs
split Î± into pairs, using the fill of Î± if a pair isn't full. equivalent to `â™¥2`
> 123456789â™¥ â‰¡ (12)(34)(56)(78)(9â– )
> 123456789â–1â™¥ â‰¡ (12)(34)(56)(78)(91)
> "things"â™¥ â‰¡ "th""in""gs"
#2 Chunks
split Î± into Î²-sized chunks, using the fill of Î± if a group isn't full. for scalar Î², this is the same as `Î±â†‘â– Î²` (see ||Take||):
> 123456789â™¥3 â‰¡ (123)(456)(789)
> 123456789â™¥4 â‰¡ (1234)(5678)(9â– â– â– )
> 123456789â–0â™¥4 â‰¡ (1234)(5678)(9000)
if Î² is a list, `Î±â™¥Î²` reshapes into groups of `Î²*` and reshapes them. equivalent to `Î±â†‘(â– ,Î²)`
> 123456789â™¥22 â‰¡ (â”‚12â”‚34)(â”‚56â”‚78)(â”‚9â– â”‚â– â– )
> "chunk brick block"â–` â™¥23 â‰¡ ("chu""nk ")("bri""ck ")("blo""ck ")
---
:char: â™¦
:ascii: 'T
:type: verb
#1 Transpose
transpose a nested list. the shape will be the minimum of the lengths of the elements, or `â••~Ã±;`
> (123)(456)(789)â™¦ â‰¡ (147)(258)(369)
> ("one""two")("three""four")â™¦ â‰¡ ("one""three")("two""four")
---
:char: â™£
:ascii: 'dm
:type: verb
#1 Domain
get the domain of a list Î±, or list of indices. same as `~â†•`.
> 1234â™£ â‰¡ 0123
> Ï†â™£ â‰¡ Ï†
> (123)(456)(789)â™£ â‰¡ 012
#2 Domain To
get the indices of the elements of a list Î±, up to a specified depth Î².
> (123)(456)(789)â™£1 â‰¡ â™ª0â™ª1â™ª2
> (123)(456)(789)â™£2 â‰¡ â”‚00â”‚01â”‚02â”‚10â”‚11â”‚12â”‚20â”‚21â”‚22
for rectangular arrays, this is similar to `Î±â–¬Î²â†•`. but if the elements have different lengths or depths, this will be reflected in the result:
> "yes""no""maybe"â™£2 â‰¡ â”‚00â”‚01â”‚02â”‚10â”‚11â”‚20â”‚21â”‚22â”‚23â”‚24
> 323"to"(â”œ100â”œ010â”œ001)â™£2 â‰¡ â™ª0â™ª1â™ª2 â”‚30â”‚31 â”‚40â”‚41â”‚42
> 323"to"(â”œ100â”œ010â”œ001)â™£3 â‰¡ â™ª0â™ª1â™ª2 â”‚30â”‚31 â”œ400â”œ401â”œ402â”œ410â”œ411â”œ412â”œ420â”œ421â”œ422
if `Î²=âˆž`, this basically returns the indices of all the scalars. this can be a good representation of the shape of an array
> 323"to"(â”œ100â”œ010â”œ001)â™£âˆž â‰¡ â™ª0â™ª1â™ª2 â”‚30â”‚31 â”œ400â”œ401â”œ402â”œ410â”œ411â”œ412â”œ420â”œ421â”œ422
> 1(2(3(4(5â– ))))â™£âˆž â‰¡ â™ª0(10)(110)(1110)(11110)(11111)
---
:char: â™ 
:ascii: 'R
:type: verb
#1 Reverse
reverse a list.
> 1234â™  â‰¡ 4321
> Ï†â™  â‰¡ Ï†
> (123)(456)(789)â™  â‰¡ (789)(456)(123)
---
:char: â€¢
:ascii: '.
:type: grammar
#n 1-Adverb
the variable `name` with 1-adverb role
> {{Î±Î²ÏƒÎ¼}}â†’d 1â€¢d23 â‰¡ 1 3 2 â– 
see also: ||Dyadic Adverb||
---
:char: â—˜
:ascii: 'O
:type: statement
#xâ—˜ Return
returns x, breaking out of the enclosing function
> 0{4Â·5â—˜6} â‰¡ 5
see also: ||Discard||, ||Then||
---
:char: â—‹
:ascii: ',
:type: grammar
#n 2-Adverb
the variable `name` with 2-adverb role
> {{Î±Î²ÏƒÎ¼}}â†’d12â—‹d34 â‰¡ 1 4 3 2
see also: ||Monadic Adverb||
---
:char: â—™
:type: whitespace
#0 Newline
whitespace
---
:char: â™‚
:ascii: 'E
:type: verb
#2 Drop
return the list Î±, with Î² elements removed from the left. Î²-pervasive. if Î² is negative, `Î²Â¢` elements are removed from the right instead (see ||Drop Right||). if Î² is equal or greater than the length, all elements are removed; an empty list is returned.
> "testing"â™‚3 â‰¡ "ting"
> "testing"â™‚_3 â‰¡ "test"
> "testing"â™‚9 â‰¡ Ï†
#1 Behead
drop 1 element from the left
> "testing"â™‚ â‰¡ "esting"
---
:char: â™€
:ascii: 'D
:type: verb
#2 Drop Right
returns the list Î±, with Î² elements removed from the right. Î²-pervasive. if Î² is negative, `Î²Â¢` elements are removed from the left instead (see ||Drop Left||). if Î² is equal or greater than the length, all elements are removed; an empty list is returned.
> "testing"â™€3 â‰¡ "test"
> "testing"â™€_3 â‰¡ "ting"
> "testing"â™€9 â‰¡ Ï†
#1 Curtail
drop 1 element from the right
> "testing"â™€ â‰¡ "testin"
---
:char: â™ª
:ascii: ':
:type: literal
#â™ªa Enclosed
for a noun `a`, literal for a list with the one argument. same as `(aâ™«)`
#â™ªF Nominalize
for a verb F, interpret it as a noun
---
:char: â™«
:ascii: ';
:type: verb
#1 Enlist
Î± is enclosed into a single-element list. this is equivalent to `{â™ªÎ±}`
> 1â™« â‰¡ â™ª1
> 1â™«â™«â™« â‰¡ â™ªâ™ªâ™ª1
#2 Pair
create a list with the elements Î± and Î². this is equivalent to `{Î±Î²}`. for scalar arguments, this is the same as ||Concatenate||
> 1â™«2 â‰¡ 12
> 1â™«2â™«3â™«4 â‰¡ ((12)3)4
> 12â™«34 â‰¡ (12)(34)
---
:char: â–º
:ascii: 'H
:type: verb
#2 Right
returns Î²
> 1â–º2 â‰¡ 2
#1 Left
returns Î±
> 1â–º â‰¡ 1
---
:char: â—„
:ascii: 'G
:type: verb
#2 Left
returns Î±
> 1â—„2 â‰¡ 1
#1 Left
returns Î±
> 1â—„ â‰¡ 1
---
:char: â†•
:ascii: 'I
:type: verb
#1 Iota
when Î± is a scalar, the output is the range of natural numbers [0, Î±); starting at 0, excluding Î± (see ||Inclusive Iota||).
> 5â†• â‰¡ 01234
> Î¦â†• â‰¡ 0123456789
therefore, `l~â†•` is a list of the indices of the list `l` (vemf is 0-indexed), and
> "list"â†’l l~â†•Â¡l â‰¡ l
this can also be found as ||Domain||
a negative argument flips the output:
> Î¦-â†• â‰¡ 9876543210
> "list"â†’l l~-â†•Â¡l â‰¡ "tsil"
when the argument is a list of scalars, the result will be a nested list that contains the indices of an array of that shape
> 34â†• â‰¡ â”‚00â”‚01â”‚02â”‚03â”‚10â”‚11â”‚12â”‚13â”‚20â”‚21â”‚22â”‚23
> 123â†• â‰¡ â”œ000â”œ001â”œ002â”œ010â”œ011â”œ012
> â™ª5â†• â‰¡ 5â†•â••â™«
> 15â†• â‰¡ 5â†•â••;0
> 0123â†• â‰¡ Ï†
> Ï†â†• â‰¡ â™ªÏ†
#2 Range
the range is [Î±, Î²)
> 2â†•6 â‰¡ 2345
---
:char: â€¼
:ascii: '!
:type: verb
#2 Replicate
it pairs up the elements of Î± and Î², and returns a new list where each element in Î± is repeated by the corresponding number in Î². this can be used as a filter if the elements of Î² are 0 or 1:
> 12345678â€¼10101010 â‰¡ 1357
> 12345678â€¼110203 â‰¡ 1244666
> "misisipi"â€¼11212121 â‰¡ "mississippi"
replicate also works with scalars and infinite lists
> 12345678â€¼2 â‰¡ 1122334455667788
> "cake"â€¼3 â‰¡ "cccaaakkkeee"
> "abcdef"â€¼.â–º â‰¡ "bccdddeeeefffff"
if Î² is longer than Î±, remaining elements are ignored; if Î± is longer than Î², Î²'s fill is used for the remaining elements
> "abcdef"â€¼10101 â‰¡ "ace"
> "abcdef"â€¼(10101â–1) â‰¡ "acef"
> "abcdef"â€¼0101010101 â‰¡ "bdf"
Î±'s fill is kept for the resulting list. negative elements in Î² indicate that the fill element will be duplicated instead
> 12345â€¼12_34 â‰¡ 122â– â– â– 4444
> 12345â–0â€¼12_34 â‰¡ 1220004444â–0
Replicate also works with nested lists in Î², and it flattens the structure:
> (123)(456)7â€¼(123)(210)3 â‰¡ 122333445777
#1 Indices
replicate the ||Domain|| of Î± (`â™£â•–â€¼`). for a boolean list Î±, this finds the indices of the ones.
> 011010110010â€¼ â‰¡ 12467:10
> 10203401â€¼ â‰¡ 02244455557
---
:char: Â¶
:ascii: '$
:type: verb
#1 Ravel
Ravel flattens all nested lists in Î±, yielding a list of all the scalars:
> ((01)23)(45(67))(8â™ª9)Â¶ â‰¡ Î¦â†•
> â™ªâ™ªâ™ªâ™ª123Â¶ â‰¡ 123
see also: ||Flatten||
#2 Reshape
make a new list with a prefix shape of Î², where the elements are taken from Î± in order. it truncates if Î± is longer than the elements needed (`Î²*`), and repeats cyclically through the list if Î± is shorter
> 6â†•Â¶55 â‰¡ (01234)(50123)(45012)(34501)(23450)
> :15â†•Â¶33 â‰¡ (012)(345)(678)
> :9â†•Â¶33 â‰¡ (012)(345)(678)
> :24â†•Â¶234 â‰¡ ( (:0:1:2:3)(:4:5:6:7)(:8:9:10:11) )( (:12:13:14:15)(:16:17:18:19)(:20:21:22:23) )
> .â–ºÂ¶33 â‰¡ (012)(345)(678)
> "testing"Â¶:21 â‰¡ "testingtestingtesting"
||Take|| is similar to ||Reshape||, but it does not repeat elements, using the fill instead.
when there is a single ||None|| in Î², it will be computed in order to fit all the elements (the ceiling division of the product of the non-||None|| elements of Î² and the length of Î±, or `Î²â–€*/(Î±~)âŒ `)
> "testing"Â¶2â–  â‰¡ "test""ingt"
> "testing"Â¶â– 2 â‰¡ "te""st""in""gt"
see also: ||Take||, ||Take Right||, ||Cycle||
---
:char: Â§
:ascii: 'ss
:type: verb
#1 Cycle
return Î± repeated infinitely as an infinite list. more precisely, it returns a function that, given an argument `x`, returns the element of Î± at index `x % (Î±~)`
> 4â†•Â§â”´Â¡0123456789 â‰¡ 0123012301
> 4â†•Â§@_1 â‰¡ 3
#2 Repeat
repeat the list Î±, Î² times. right-pervasive.
> "testing"Â§3 â‰¡ "testingtestingtesting"
> 6Â§3 â‰¡ 666
---
:char: â–¬
:ascii: 'M 'sh
:type: verb
#1 Shape
get the shape of Î±, that is, the maximum length for each dimension. the output will be a list with fill 1.
> 1â–¬ â‰¡ Ï†â–1
> 123â–¬ â‰¡ â™ª3â–1
> ((01)23)(45(67)7)(8â™ª9)â–¬ â‰¡ 342â–1
> â™ªâ™ªâ™ªâ™ª123â–¬ â‰¡ 31111â–1
> â™ªâ™ªâ™ªâ™ª(123)â–¬ â‰¡ 11113â–1
> (123)(456)(789)â–¬ â‰¡ 33â–1
> (1234)(5678)(9012)â–¬ â‰¡ 34â–1
> (123)(5678)(90)â–¬ â‰¡ 34â–1
see also: ||Length||, ||Depth||
#2 Shape Up To
get only up to a specified depth, without fill.
> (1234)((56)(78))(90)â–¬  â‰¡ 342â–1
> (1234)((56)(78))(90)â–¬4 â‰¡ 3421
> (1234)((56)(78))(90)â–¬3 â‰¡ 342
> (1234)((56)(78))(90)â–¬2 â‰¡ 34
> (1234)((56)(78))(90)â–¬1 â‰¡ â™ª3
---
:char: â†¨
:ascii: 'J
:type: verb
#1 Inclusive Iota
when Î± is a scalar, the output is the range of natural numbers [1, Î±]; starting at 1, including Î±.
> 5â†¨ â‰¡ 12345
> Î¦â†¨ â‰¡ 123456789Î¦
this is really just ||Iota|| with every item incremented by 1, or `â†•â–²`.
the extensions that ||Iota|| has, like negative numbers and lists, will also work with Inclusive Iota:
> Î¦-â†¨ â‰¡ Î¦987654321
> 34â†¨ â‰¡ â”‚11â”‚12â”‚13â”‚14â”‚21â”‚22â”‚23â”‚24â”‚31â”‚32â”‚33â”‚34
> 123â†¨ â‰¡ â”œ111â”œ112â”œ113â”œ121â”œ122â”œ123
#2 Inclusive Range
the range used is [Î±, Î²]. note that this means the resulting array is of length `Î²-Î±+1`.
> 2â†¨8 â‰¡ 2345678
---
:char: â†‘
:ascii: 'W
:type: verb
#2 Take
make a new list with a prefix shape of Î², where the elements are taken from Î± in order. this truncates if Î± is longer than the elements needed (`Î²*`), and uses the fill of Î± if Î± is shorter.
> 9â†•â†‘55 â‰¡ (01234)(5678â– )(â– â– â– â– â– )(â– â– â– â– â– )(â– â– â– â– â– )
> :99â†•â†‘33 â‰¡ (012)(345)(678)
> .â–ºâ†‘33 â‰¡ (012)(345)(678)
> "testing"â–` â†‘:21 â‰¡ "testing              "
> "testing"â†‘3 â‰¡ "tes"
||Reshape|| is similar, but it cycles through the array instead of using the fill.
when there is a single ||None|| in Î², it will be computed in order to fit all the elements (the ceiling division of the product of the non-||None|| elements of Î² and the length of Î±, or `Î²â–€*/(Î±~)âŒ `)
> "testing"â–`_â†‘2â–  â‰¡ "test""ing_"
> "testing"â–`_â†‘â– 2 â‰¡ "te""st""in""g_"
> "testing"â–`_â†‘â– 3 â‰¡ "tes""tin""g__"
these last cases can be replaced by ||Chunks|| or ||Pairs||:
> "testing"â–`_â™¥3 â‰¡ "tes""tin""g__"
> "testing"â–`_â™¥ â‰¡ "te""st""in""g_"
see also: ||Reshape||, ||Take Right||, ||Drop||
#1 Prefixes
get the prefixes of the list Î±; take for every item in `Î²â™£â–²` (without the empty list, but with the unmodified argument: you can remove it with ||Behead||.)
> "testing"â†‘ â‰¡ "t" "te" "tes" "test" "testi" "testin" "testing"
see also: ||Suffixes||
---
:char: â†“
:ascii: 'S
:type: verb
#2 Take Right
make a new list with a prefix shape of Î², where the elements are taken from Î± in reverse order. this truncates if Î± is longer than the elements needed (`Î²*`), and uses the fill of Î± if Î± is shorter.
> 9â†•â†“55 â‰¡ (â– â– â– â– â– )(â– â– â– â– â– )(â– â– â– â– â– )(â– 0123)(45678)
> 9â†•â†“23 â‰¡ (345)(678)
when there is a single ||None|| in Î², it will be computed in order to fit all the elements (the ceiling division of the product of the non-||None|| elements of Î² and the length of Î±, or `Î²â–€*/(Î±~)âŒ `)
> "testing"â†“3 â‰¡ "ing"
> "testing"â–` â†“:21 â‰¡ "              testing"
> "testing"â–`_â†“2â–  â‰¡ "_tes""ting"
> "testing"â–`_â†“â– 2 â‰¡ "_t""es""ti""ng"
see also: ||Take||, ||Reshape||
#1 Suffixes
get the suffixes of the list Î±; take for every item in `Î²â™£â–²` (without the empty list, but with the unmodified argument: you can remove it with ||Curtail||.)
> "testing"â†“ â‰¡ "g" "ng" "ing" "ting" "sting" "esting" "testing"
see also: ||Prefixes||
---
:char: â†
:ascii: 'vr
:type: verb
#1 Get Variable
get the variable with name Î±
> "_a"â† â‰¡ :12
> `Ã¦â†’ash "ash"â† â‰¡ `Ã¦
#2 Set Variable
set a new local variable with name Î± to Î²
> "ampersand"â†`Ã±Â·.ampersand â‰¡ `Ã±
---
:char: â†’
:ascii: '^
:type: statement
#xâ†’name Set
sets a variable to x in the local scope.
> 2â†’two .two+.two â‰¡ 4
if there is nothing in the statement body, the variable will be removed from the local scope.
> 4â†’a0{5â†’a â†’a a} â‰¡ 4
this is a statement, so verbs can be set conveniently:
> +2â†’add 3:add â‰¡ 5
see also: ||Set Function||
---
:char: âˆŸ
:ascii: 'L
:type: verb
#1 Natural Logarithm
get the ||natural logarithm@https://en.m.wikipedia.org/wiki/Natural_logarithm|| of Î±. scalar.
> 2âˆŸ^ â‰¡ 2
> 1âˆŸ â‰¡ 0
> 2âˆŸ â‰¡ :0.6931471805599453
#2 Logarithm
get the ||logarithm@https://en.m.wikipedia.org/wiki/Logarithm|| base Î² of Î±. scalar.
> :1000âˆŸÎ¦ Â± 3
> Î¦âˆšâˆŸÎ¦ â‰¡ 2/
---
:char: â†”
:ascii: '*
:type: grammar
#xâ†”name Mutate
mutate a variable in any scope, by applying a function to it monadically. 
> :21â†’n *3â†”n n â‰¡ :63
this is a statement, so the verb starts where the previous statement ends. this might not work like you might expect it to:
> 3N 4M *2â†”n n â‰¡ 8
because the body of the statement includes ||Set Function||s, which are syntactically verbs:
> (3N4M*2)â†”n n â‰¡ 8    ' 3â”€n4â”€m*2 returns 8
> 3â†’n 4â†’m *2â†”n n â‰¡ 6  ' but this works
if there is nothing in the statement body, the variable will be removed from its scope.
> 3â†’n 4â†’m *2â†”n n â‰¡ 6
> 4â†’a0{â†”a}Â·a â‰¡ â– 
see also: ||Mutate Function||
---
:char: â–²
:ascii: 'bu
:type: verb
#1 Bump Up
increments the number by 1. equivalent to `+1`. scalar.
> 2â–² â‰¡ 3
> 0â–²â–²â–²â–²â–²â–² â‰¡ 6
> 123â–² â‰¡ 234
see also: ||Bump Down||, ||Add||
#2 Bins Up
run a binary search. when Î± is a list sorted in ascending order, it finds the position of the first element in Î± that is less than or equal to Î². you can also think of the list Î± as intervals of shape [x, y)
> 0259â–²6 â‰¡ 3
> 0259â–²Î˜0123456789Î¦ â‰¡ 011222333344
> "Sample text was first invented in 1894 by James Sample."â”´â–²"0:" â‰¡ 2222220222202220222220222222220220111102202222202222220
see also: ||Bins Down||
---
:char: â–¼
:ascii: 'bd
:type: verb
#1 Bump Down
decrements the number by 1. equivalent to `-1`. scalar.
> 3â–¼ â‰¡ 2
> 0â–¼â–¼â–¼â–¼â–¼â–¼ â‰¡ _6
> 123â–¼ â‰¡ 012
see also: ||Bump Up||, ||Subtract||
#2 Bins Down
run a binary search. when Î± is a list sorted in descending order, it finds the position of the first element in Î± that is greater than or equal to Î².
> :18:13:8â–¼:20 â‰¡ 0
> :18:13:8â–¼:18 â‰¡ 0
> :18:13:8â–¼:15 â‰¡ 1
> :18:13:8â–¼:12 â‰¡ 2
> :18:13:8â–¼:2 â‰¡ 3
see also: ||Bins Up||
---
:char:  
:type: whitespace
#&nbsp; Space
whitespace. may change the parsing of some tokens:
> Â¨things  â‰¡ "things"
> Â¨thing s â‰¡ "thing"s
> :2022  â‰¡ (:2022)
> :202 2 â‰¡ (:202)(2)
---
:char: !
:type: verb
#1 Factorial
get the factorial of Î±. this is extended to reals with the ||Gamma function@https://en.wikipedia.org/wiki/Gamma_function||, Î“(Î± + 1). scalar.
> 0! â‰¡ 1
> 1! â‰¡ 1
> 3! â‰¡ 6
> 4! â‰¡ :24
> 5! â‰¡ :120
> 7! â‰¡ :5040
> Î¦! â‰¡ :3628800
> :-0.5! Â± Ï€âˆš
#2 Permute
number of Î²-permutations in Î± items. also known as the ||falling factorial@https://en.wikipedia.org/wiki/Falling_and_rising_factorials||, descending factorial, pochhammer symbol, or the nPr key in your calculator. equivalent to `-â•“!â•‘/` or `{Î±!/(Î±-Î²!)}`. scalar.
> 1!1 â‰¡ 1
> 3!2 â‰¡ :6
> 4!3 â‰¡ :24
> 8!3 â‰¡ :336
---
:char: "
:type: literal
#"abcd" Quotes
string literal; every character until the next `"` will be put into a list with ||None|| fill
> "" â‰¡ Ï†
> "a" â‰¡ â™ª`a
> "abc" â‰¡ `a`b`c
this uses the codepage codepoints:
> "â˜ºâ˜»â™¥â™¦" â‰¡ 1234
with some special characters used specially: `Â¨` stands for `"` (0x22) and `Â·` stands for `'` (0x27). `'` may be used for escaping these:
> "he said Â¨hiÂ¨"   â‰¡ "he said ",`","hi",`"
> "umlaut â”€ 'Â¨ â† diaeresis" â‰¡ "umlaut â”€ ",`Â¨," â† diaeresis"
---
:char: #
:type: verb
#1 First True
find the first non-0 value and return its index, or else ||None||.
> 10101010# â‰¡ 0
> 0001010# â‰¡ 3
> 00002010# â‰¡ 4
> 0000000# â‰¡ â– 
#2 Index Of
find the first exact match in the list and return its index, or else ||None||. Î²-pervasive.
> "hello"#`l â‰¡ 2
> "abcdefghijklmnopqrs"#"beeimpostor" â‰¡ :1:4:4:8:12:15:14:18â– :14:17
> 012073167140#0123456789 â‰¡ 0125Î¦â– 74â– â– 
---
:char: $
:type: verb
#1 Call with None
calls the function Î± with ||None|| as an argument
> .â™«$ â‰¡ â™ªâ– 
#2 Call
calls the function Î± with `Î²@0` and `Î²@1` (only if `Î²~ â‰¥ 2`) as arguments.
> .+$23 â‰¡ 5
> .+$234 â‰¡ 5
> .-$2 â‰¡ _2
> .â™«$24 â‰¡ 24
---
:char: %
:type: verb
#1 Power of Two
calculate 2 to the power of Î±. equivalent to `â”´^2`. scalar.
> 0% â‰¡ 1
> 4% â‰¡ :16
> :32% â‰¡ :4294967296
#2 Modulo
returns the ||modulo@https://en.m.wikipedia.org/wiki/Modulo|| of Î± divided by Î², also known as the remaider. scalar.
> 7%5 â‰¡ 2
> 2%5 â‰¡ 2
> _3%5 â‰¡ 2
> 4%0 â‰¡ â– 
> :20â†•%3 â‰¡ 0120120120 1201201201
> :20â†•-9â””Ã·â™«%3â‰¡(_3_3_3_2_2_2Î˜Î˜Î˜00011122233)(01201201201201201201) â‰¡ 1
this is euclidean modulo; it always gives a positive result such that `Î²*(aÃ·Î²) + (Î±%Î²) â‰¡ Î±`.
> 1%2 â‰¡ 1
> 1%_2 â‰¡ 1
> _1%2 â‰¡ 1
> _1%_2 â‰¡ 1
---
:char: &
:type: verb
#2 And
compute boolean AND of Î± and Î². return 1 if both Î± and Î² are nonzero, otherwise 0. scalar.
> 0&0 â‰¡ 0
> 0&1 â‰¡ 0
> 1&0 â‰¡ 0
> 1&1 â‰¡ 1
> 2&2 â‰¡ 1
see also: ||Or||, ||Maximum||
#1 All
return 1 if all the items in Î± are non-zero. equivalent to `â•§&1`
> 0110101010& â‰¡ 0
> 1111111111& â‰¡ 1
> 1273981913& â‰¡ 1
for an empty list, this is always 1:
> Ï†& â‰¡ 1
see also: ||And||, ||Any||
---
:char: '
:type: literal
#'&#x20;abc Line Comment
all of the characters until the next line break will be ignored.
#'A,'ab Escape
escapes are one way to write characters outside the ascii range (characters in the range 0x20 ` ` to 0x7E `~`, the ones that you almost certainly have in your keyboard). you will see the escapes in the documentation of each character.
there are more non-ascii characters than ascii characters in the codepage (256 âˆ’ 95 = 161), so some characters need two character escape sequences. these start with a lowercase letter [`a`, `z`].
the characters with single character escape sequences are the following:
> !"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`{|}~
> â€¼â••â˜»Â¶Ã·Â·'â•™â•œâ†”Â±â—‹Â¬â€¢â•§â•£â”˜â”‚â”œâ•žâ•Ÿâ• â”¤â•¡â•¢â™ªâ™«â‰¤â‰¡â‰¥Â¿Â¡Î±Î²Â¢â™€â™‚Æ’â—„â–ºâ†•â†¨â””âˆŸâ–¬â– â—˜â•¨Î˜â™ â†“â™¦â•©âˆšâ†‘Î¦Â¥Ï†â•“â•¤â•–â†’âŒâ”´â•˜â”¬â•›â‰ˆ
#'[Ã‡Ã¼Ã©Ã¢Ã¤Ã Ã¥Ã§ÃªÃ«Ã¨Ã¯Ã®Ã¬Ã„Ã…Ã‰]ab Unicode Escape
Unicode Escapes are vemf's wacky way of allowing unicode text in source code while still using the vemf codepage internally.
the first character can be any of "Ã‡Ã¼Ã©Ã¢Ã¤Ã Ã¥Ã§ÃªÃ«Ã¨Ã¯Ã®Ã¬Ã„Ã…Ã‰" (or 0x80-0x91), and it specifies the bits 16-21 of the unicode codepoint, or the ||plane number@https://en.wikipedia.org/wiki/Plane_(Unicode)|| (plus 128). the next two bytes encode the other two bytes of the codepoint.
though currently only planes 0, 1, 2, 3, 14, 15, 16 (`Ã‡Ã¼Ã©Ã¢Ã„Ã…Ã‰`) are used, the whole range of unicode characters up to U+10FFFF is supported, except for the UTF-16 surrogates U+D800-U+DFFF.
for example, to encode the emoji ðŸˆ, with codepoint `U+1F408`, use the characters `0x81 0xF4 0x08` or `'Ã¼âŒ â—˜`:
> "'Ã¼âŒ â—˜" â‰¡ "ðŸˆ"
most characters you care about are in the plane 0, or the Basic Multilingual Plane. they will always start with `'Ã‡`.
> "'Ã‡Â¤Â«" â‰¡ "Â®" ' U+00AE REGISTERED SIGN
> "'Ã‡"`" â‰¡ "â‰ " ' U+2260 NOT EQUAL TO
> "'Ã©Â¤!" â‰¡ "ð €¡" ' U+20021 CJK UNIFIED IDEOGRAPH-20021
> "'Ã¢â–ºl" â‰¡ "ð±¬" ' U+3106C CJK UNIFIED IDEOGRAPH-3106C
escaping characters that are in the vemf codepage correspond to just the characters:
> "'Ã‡â™¥â•¡" â‰¡ â™ª`Îµ ' U+03B5 GREEK SMALL LETTER EPSILON
unicode characters outside of literals can be verbs, adverbs or nouns depending on the character. see more details in src/token.rs.
> âˆš3â†’âˆ› :64âˆ› Â± 4
---
:char: (
:type: grammar
#(x) Opening Parenthesis
groups multiple words in a single noun. often used to change verb or adverb precedence,
> 1+2*3 â‰¡ 9
> 1+(2*3) â‰¡ 7
or to group elements in a strand or train,
> (123)(456)(789)@0 â‰¡ 123
> 001334(Ã»Â¬)â•“â€¼ â‰¡ 0134
often, you won't need to close a parenthesis, like in the end of a file or a statement
> 1+(2*3â†’seven .seven*2 â‰¡ :14
parentheses can be thought of having less precedence than braces `{}`
> :15{"number ",(Î±Âª} â‰¡ "number 15"
if there arent many words inside the parenthesis, ||Grouping|| may be used instead
> â”œ123â”œ456â”œ789@0 â‰¡ 123
> 001334â”‚Ã»Â¬â•“â€¼ â‰¡ 0134
an empty parenthesis is the same as ||Empty List||
> () â‰¡ Ï†
---
:char: )
:type: grammar
#(x) Closing Parenthesis
closing counterpart of ||Opening Parenthesis||.
---
:char: *
:type: verb
#2 Multiply
calculate Î± Ã— Î². scalar.
> 3*3 â‰¡ 9
> 2*3 â‰¡ 6
> 4*4 â‰¡ :16
> `a*`b â‰¡ `b*`a
#1 Product
multiply all the items in Î±. equivalent to `â•§*`.
> 234* â‰¡ :24
> 2222* â‰¡ :16
> (123)(456)(789)* â‰¡ :28:80:162
> (123)(456)(789)** â‰¡ :362880  ' 9!
the empty product is the multiplicative identity, 1.
> Ï†* â‰¡ 1
see also: ||Reduce||, ||Sum||
---
:char: +
:type: verb
#2 Add
calculate Î± + Î². scalar.
> 3+2 â‰¡ 5
> 4+3 â‰¡ 7
> `a+`b â‰¡ `b+`a
#1 Sum
add all the items in Î±. equivalent to `â•§+`.
> 1234+ â‰¡ :10
> (123)(456)(789)+ â‰¡ :12:15:18
> (123)(456)(789)++ â‰¡ :45
the empty sum is the additive identity, 0.
> Ï†+ â‰¡ 0
see also: ||Reduce||, ||Product||
---
:char: ,
:type: verb
#1 Flatten
same as ||Reduce|| ||Concatenate|| `â•§,`. this removes one level of nesting in Î±.
> Â¨fooÂ¨barÂ¨bash, â‰¡ "foobarbash"
> (012)(34(567))(89), â‰¡ 01234(567)89
this returns ||None|| for empty lists:
> Ï†, â‰¡ Ï†
see also: ||Reshape||
#2 Concatenate
concatenate the two lists Î± and Î²
> 123,456 â‰¡ 123456
> "Hello,"," world" â‰¡ "Hello, world"
a scalar argument is used as a 1-argument list:
> 1,1 â‰¡ 11
> 12,3 â‰¡ 123
> 1,23 â‰¡ 123
> 1,2,3 â‰¡ 123
see also: ||Pair||, ||Append||, ||Prepend||
---
:char: -
:type: verb
#1 Negate
calculate âˆ’Î±. scalar
> 1- â‰¡ :-1
> Î¦- â‰¡ :-10
> 2--2 â‰¡ _4
> 123- â‰¡ _1_2_3
> 3-- â‰¡ 3
#2 Subtract
calculate Î± âˆ’ Î². scalar
> 3-2 â‰¡ 1
> 4-1 â‰¡ 3
> 3-0 â‰¡ 3
---
:char: .
:type: grammar
#n Noun
the variable `name` with noun role.
if not defined, will return ||None||.
> .kjfghkjbgihjbhekjgerbn â‰¡ â– 
see also: ||Set||, ||Mutate||
---
:char: /
:type: verb
#1 Reciprocal
get the reciprocal of Î±, or 1/Î±. scalar
> 6/ â‰¡ 1/6
> 8/ â‰¡ :0.125
#2 Divide
calculate Î± / Î². scalar
> 6/2 â‰¡ 3
> 6/3 â‰¡ 2
> 0/0 â‰¡ â– 
---
:char: 0
:type: noun
#0 Zero
the integer 0
#.0 
the number `0.01`, or `:100/`
---
:char: 1
:type: noun
#0 One
the integer 1
#_0 Minus One
the integer âˆ’1
#.0 
the number `0.1`, or `Î¦/`
---
:char: 2
:type: noun
#0 Two
the integer 2
#_0 Minus Two
the integer âˆ’2
#.0
the number `0.2`, or `5/`
---
:char: 3
:type: noun
#0 Three
the integer 3
#_0 Minus Three
the integer âˆ’3
#.0
the number `0.3`, or `3/Î¦`
---
:char: 4
:type: noun
#0 Four
the integer 4
#_0 Minus Four
the integer âˆ’4
#.0
the number `0.4`, or `2/5`
---
:char: 5
:type: noun
#0 Five
the integer 5
#_0 Minus Five
the integer âˆ’5
#.0
the number `0.5`, or `5/Î¦`
---
:char: 6
:type: noun
#0 Six
the integer 6
#_0 Minus Six
the integer âˆ’6
#.0
the number `0.6`, or `3/5`
---
:char: 7
:type: noun
#0 Seven
the integer 7
#_0 Minus Seven
the integer âˆ’7
#.0
the number `0.7`, or `7/Î¦`
---
:char: 8
:type: noun
#0 Eight
the integer 8
#_0 Minus Eight
the integer âˆ’8
#.0
the number `0.8`, or `4/5`
---
:char: 9
:type: noun
#0 Nine
the integer 9
#_0 Minus Nine
the integer âˆ’9
#.0
the number `0.9`, or `9/Î¦`
---
:char: :
:type: grammar
#n Verb
the variable `name` with verb role
#:123 Numeric Literal
when the character after the colon is a decimal digit `[0-9]` or the negative sign `-`, it will be interpreted as a number (integer or floating point).
> :12 â‰¡ Î¦+2
> :39 â‰¡ 3*Î¦+9
> :256 â‰¡ 2^8
> :-3 â‰¡ _3
> :12:24:32/4 â‰¡ 368
this also supports decimals, with a decimal point `.` or ||scientific notation@https://en.wikipedia.org/wiki/Scientific_notation|| using `e`:
> :43.21 â‰¡ :4321/:100
> :6.022e23 â‰ˆ :6.022*(Î¦^:23)
> :1.6605eâˆ’27 â‰ˆ :1.6605/(Î¦^:27)
> :0.01 â‰¡ 1/:100
> :1e-2 â‰¡ 1/:100
this syntax allows for `0x` `0b` `0o` `0s` `0z` `0n` for hexadecimal, binary, octal, senary, duodecimal, hexatrigesimal respectively. these use the digits `0-9` and `a-z` (always in lowercase):
> :0xff â‰¡ :255
> :0xdeadbeef â‰¡ :3735928559
> :-0nxyz â‰¡ :-44027
> :0x100000000 â‰¡ 2^:32
the syntax looks a bit like this:
> number := ":" "-"? (decimal | based)
> decimal := [0-9]+ ("." [0-9]*)? ("e" "-"? [0-9]+)?
> based := "0x" [0-9a-f]*
>        | "0b" [0-1]*
>        | "0o" [0-7]*
>        | "0s" [0-5]*
>        | "0z" [0-9a-b]*
>        | "0n" [0-9a-z]*
note that whitespace ends a literal:
> :1 234 â‰¡ (1)(2)(3)(4)
> :12 34 â‰¡ (:12)(3)(4)
> :123 4 â‰¡ (:123)(4)
> :1234  â‰¡ :1234
see also: ||Integer Literals||
---
:char: ;
:type: verb
#1 Duplicate
forms a pair `Î±Î±`. same as `â”´â™«`
> 5; â‰¡ 55
> 123; â‰¡ (123)(123)
#2 Procatenate
concatenates Î² to Î±. same as `â”´,`
> 5;4;3 â‰¡ 345
> 123;456 â‰¡ 456123
---
:char: <
:type: verb
#1 Grade Up
Grade Up can be used for sorting. it returns a permutation, or list of indices, that would sort the list descendingly. you can think of this as sorting the array `Î±~â†•` according to Î±
> 37625< â‰¡ 30421
> 37625<Â¡37625 â‰¡ 23567
> 37625<â•–Â¡ â‰¡ 23567  ' more tacit
this uses stable sorting: the same array will always yield the same permutation, and equal arguments are ordered by position.
see also: ||Grade Down||, ||Sort Up||
#2 Less Than
return 1 if Î± < Î², else 0. scalar.
> 5<3 â‰¡ 0
> 3<3 â‰¡ 0
> 3<5 â‰¡ 1
see also: ||Greater Than||
#_2 Lexicographic Less Than
return 1 if Î± < Î², else 0. this function is not scalar; if any of the two elements are lists, it will compare lexicographically:
> 234_<235 â‰¡ 1
> 234_<233 â‰¡ 0
> 234_<263 â‰¡ 1
> 334_<263 â‰¡ 0
if both lists don't have the same length, the extra items are compared with the smaller's list fill. the default fill is ||None||, and ||None|| is less than every other value, so a list is greater than its prefixes:
> "cat"_<"catnip" â‰¡ 1
> "cat"â–`z_<"catnip" â‰¡ 0
see also: ||Lexicographic Greater Than||
---
:char: =
:type: verb
#1 Depth
get the depth of the deepest element in Î±. same as `â–¬~`
> 1= â‰¡ 0
> 123= â‰¡ 1
> ((01)23)(45(67)7)(8â™ª9)= â‰¡ 3
> â™ªâ™ªâ™ªâ™ª123= â‰¡ 5
> â™ªâ™ªâ™ªâ™ª(123)= â‰¡ 5
> (123)(456)(789)= â‰¡ 2
> (1234)(5678)(9012)= â‰¡ 2
> (123)(5678)(90)= â‰¡ 2
> (1234)((56)(78))(90)= â‰¡ 3
see also: ||Shape||
#2 Equals
return 1 if Î± = Î², else 0. scalar.
> 5=3 â‰¡ 0
> 3=3 â‰¡ 1
> 3=5 â‰¡ 0
> 123454321234=2 â‰¡ 010000010100
> "words words words"=`  â‰¡ 00000100000100000
two NaNs compare equal:
> â– =â–  â‰¡ 1
see also: ||Matches||, ||Not Equals||
---
:char: >
:type: verb
#1 Grade Down
Grade Down can be used for sorting. it returns a permutation, or list of indices, that would sort the list descendingly. you can think of this as sorting the array `Î±â™£-` according to Î±.
> 37625> â‰¡ 12403
> 37625>Â¡37625 â‰¡ 76532
> 37625>â•–Â¡ â‰¡ 76532  ' more tacit
this uses stable sorting: the same array will always yield the same permutation, and equal arguments are ordered by position.
see also: ||Grade Up||, ||Sort Down||
#2 Greater Than
return 1 if Î± > b, else 0. scalar.
> 5>3 â‰¡ 1
> 3>3 â‰¡ 0
> 3>5 â‰¡ 0
see also: ||Less Than||
#_2 Lexicographic Greater Than
return 1 if Î± < Î², else 0. this function is not scalar; if any of the two elements are lists, it will compare lexicographically:
> 234_>235 â‰¡ 0
> 234_>233 â‰¡ 1
> 234_>263 â‰¡ 0
> 334_>263 â‰¡ 1
if both lists don't have the same length, the extra items are compared with the smaller's list fill. the default fill is ||None||, and ||None|| is less than every other value, so a list is greater than its prefixes:
> "cat"_>"catnip" â‰¡ 0
> "cat"â–`z_>"catnip" â‰¡ 1
see also: ||Lexicographic Less Than||
---
:char: ?
:type: statement
#x?y Then
execute statement y if x is not 0 or ||Null||. if x is a function, it will be called with Î± and, if `Î£~1`, Î².
> _3â†’b b<0?-â†”b b â‰¡ 3
>  5â†’b b<0?-â†”b b â‰¡ 5
||Return|| may be used for short-circuiting. this is the same as your familiar ternary statement.
> _3{<0?Î±-â—˜Î±} â‰¡ 3
>  5{<0?Î±-â—˜Î±} â‰¡ 5
> 5â†’a[a<0?a-â—˜a] â‰¡ 5
---
:char: @
:type: verb
#1 First
get the first item in a list Î±. this is equivalent to calling Î± with 0.
> "aeiou"@ â‰¡ `a
> (12)(34)@ â‰¡ 12
> (+2)@ â‰¡ 2
#2 Index
get the element in list Î± at index Î²
> "aeiou"@2 â‰¡ `i
> 4321@1 â‰¡ 3
> (12)(34)(56)(78)@2 â‰¡ 56
if Î± is a function, it will be called with the index:
> (-)@3 â‰¡ _3
> (*3-2)@5 â‰¡ :13
> (â™ )@"bee" â‰¡ "eeb"
if the index is outside the list's domain [0, Î±~), or if it is null, it uses its fill
> 123@5 â‰¡ â– 
> 123â–0@5 â‰¡ 0
> 123â–0@â–  â‰¡ 0
when Î± and Î² are lists, this indexes at depth, so that `l@20 â‰¡ l@2@0`
> (12)(34)(56)(78)@20 â‰¡ 5
> (12)(34)(56)(78)@21 â‰¡ 6
> (+3)(-2)(Â½)(Ã·8)@27 â‰¡ :3.5
in this case, null selects all the items. this can be useful for retrieving columns of a matrix
> 123@â™ªâ–  â‰¡ 123
> (12)(34)(56)(78)@2â–  â‰¡ 56
> (12)(34)(56)(78)@â– 1 â‰¡ 2468
> (123)(456)(789)@1â–  â‰¡ 456
> (123)(456)(789)@â– 1 â‰¡ 258
> (123)(456)(789)@â– 2 â‰¡ 369
---
:char: A
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€a`.
#_0 Uppercase Letters
the string `"ABCDEFGHIJKLMNOPQRSTUVWXYZ"`
---
:char: B
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€b`.
#_0 Letters
the string `"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz"`
---
:char: C
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€c`.
#_0 Lowercase Letters
the string `"abcdefghijklmnopqrstuvwxyz"`
---
:char: D
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€d`.
#_0 Digits
the string `"0123456789"`
---
:char: E
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€e`.
#_0 Digits and Letters
the string `"0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz"`
---
:char: F
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€f`.
#_0 Digits and Uppercase Letters
the string `"0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ"`
---
:char: G
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€g`.
#_0 Digits and Lowercase Letters
the string `"0123456789abcdefghijklmnopqrstuvwxyz"`
---
:char: H
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€h`.
#_0 Uppercase Hexadecimal
the string `"0123456789ABCDEF"`
---
:char: I
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€i`.
#_0 Lowercase Hexadecimal
the string `"0123456789abcdef"`
---
:char: J
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€j`.
#_0 Base-64
the string `"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/"`
---
:char: K
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€k`.
#_0 Alternate Base-64
the string `"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789-_"`
---
:char: L
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€l`.
---
:char: M
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€m`.
---
:char: N
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€n`.
---
:char: O
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€o`.
---
:char: P
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€p`.
---
:char: Q
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€q`.
---
:char: R
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€r`.
---
:char: S
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€s`.
---
:char: T
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€t`.
---
:char: U
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€u`.
---
:char: V
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€v`.
---
:char: W
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€w`.
---
:char: X
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€x`.
---
:char: Y
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€y`.
---
:char: Z
:type: verb_variable
#12
general-purpose verb variable. by default, `â”€z`.
---
:char: [
:type: grammar
#[abc] Start Block
list of statements that are executed until a ||Return|| or the end is found, and return that value. similar to a ||Define Function||, but it is immediately executed and doesn't have a scope. most useful with `?` ||Then||, as it can be used to simulate a ternary operator:
> 6â†’a a%3=0?[/3â†”a "a is now ",(aâ¿] â‰¡ "a is now 2"
> [1+1=2?"yay"â—˜"oh no"]Ã‡ â‰¡ "YAY"
---
:char: \
:type: verb
#1 Filter Holes
remove ||None||s in the list Î±.
> â– 12â– 345â– â– 67â– 89\ â‰¡ 123456789
#2 Set Difference
return Î± without the items in Î²
> "hello world i am a vemf test"\`  â‰¡ "helloworldiamavemftest"
> "hello world i am a vemf test"\Â¨aeiou â‰¡ "hll wrld  m  vmf tst"
---
:char: ]
:type: grammar
#[abc] End Block
closing counterpart of `[` ||Start Block||.
---
:char: ^
:type: verb
#1 Exponential
calculate ||exp Î±@https://en.wikipedia.org/wiki/Exponential_function||, or e^Î±, where e is Euler's number. scalar.
> 1^ â‰¡ :2.718281828459045
> 3^ â‰¡ :20.085536923187668
#2 Exponent
calculate ||Î± raised to the power of Î²@https://en.wikipedia.org/wiki/Exponentiation||. scalar.
> 2^6 â‰¡ :64
> 3^5 â‰¡ :243
---
:char: _
:type: grammar
#&#x5f;a Alternate
the underscore is used for accessing variant forms of functions or variables. `_a` is equivalent to `."_a"`, `:"_a"`, `â€¢"_a"` or `â—‹"_a"` depending on the rank of `a`
for numbers (`123456789Î¦`), this will be its negative:
> _1_2_3_4_5_6_7_8_9_Î¦ â‰¡ 123456789Î¦-
uppercase ascii letters (`A`-`Z`) store convenient constants:
> _A â‰¡ "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
> _B â‰¡ "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz"
> _C â‰¡ "abcdefghijklmnopqrstuvwxyz"
> _D â‰¡ "0123456789"
> _E â‰¡ "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz"
> _F â‰¡ "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ"
> _G â‰¡ "0123456789abcdefghijklmnopqrstuvwxyz"
> _H â‰¡ "0123456789ABCDEF"
> _I â‰¡ "0123456789abcdef"
> _J â‰¡ "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/"
> _K â‰¡ "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789-_"
---
:char: `
:type: literal
#`a Character Literal
the position of `a` in the codepage
> `a â‰¡ :97
> `b â‰¡ :98
> `âŒ¡ â‰¡ :245
see also: ||Digraph Literal||
---
:char: a
:type: variable
#0
a general-purpose variable. by default, 12
---
:char: b
:type: variable
#0
a general-purpose variable. by default, 20
---
:char: c
:type: variable
#0
a general-purpose variable. by default, 99
---
:char: d
:type: variable
#0
a general-purpose variable. by default, 100
---
:char: e
:type: variable
#0
a general-purpose variable. by default, 999
---
:char: f
:type: variable
#0
a general-purpose variable. by default, 1000
---
:char: g
:type: variable
#0
a general-purpose variable. by default, 10000
---
:char: h
:type: variable
#0
a general-purpose variable. by default, 100000
---
:char: i
:type: variable
#0
a general-purpose variable. by default, 1000000
---
:char: j
:type: variable
#0
a general-purpose variable. by default, 10000000
---
:char: k
:type: variable
#0
a general-purpose variable. by default, 15
---
:char: l
:type: variable
#0
a general-purpose variable. by default, 16
---
:char: m
:type: variable
#0
a general-purpose variable. by default, 31
---
:char: n
:type: variable
#0
a general-purpose variable. by default, 32
---
:char: o
:type: variable
#0
a general-purpose variable. by default, 63
---
:char: p
:type: variable
#0
a general-purpose variable. by default, 64
---
:char: q
:type: variable
#0
a general-purpose variable. by default, 127
---
:char: r
:type: variable
#0
a general-purpose variable. by default, 128
---
:char: s
:type: variable
#0
a general-purpose variable. by default, 255
---
:char: t
:type: variable
#0
a general-purpose variable. by default, 256
---
:char: u
:type: variable
#0
a general-purpose variable. by default, 512
---
:char: v
:type: variable
#0
a general-purpose variable. by default, 1024
---
:char: w
:type: variable
#0
a general-purpose variable. by default, 32768
---
:char: x
:type: variable
#0
a general-purpose variable. by default, 65536
---
:char: y
:type: variable
#0
a general-purpose variable. by default, 16777216, or `2^:24`
---
:char: z
:type: variable
#0
a general-purpose variable. by default, 2147483648, or `2^:31`
---
:char: {
:type: grammar
#{abc} Define Function
return a function that executes the statements inside the braces, returning a value and stopping once a ||Return|| statement is hit. a ||Return|| statement is implicit at the end of a function. this function will have a role of verb.
> {"Hello, World!"â˜»Â·}â†’sayhi 0:sayhi â‰¡ â– 
> {6Ã¡â–²â—˜}â†’roll 0:roll ?â‰¡ 4
> {6Ã¡â–²}â†’roll 0:roll ?â‰¡ 4
some variables are set when calling a function: `Î±` ||Alpha|| is set to the left argument, `Î²` ||Beta|| is set to the right argument or ||None|| if not given, `Æ’` ||Self|| to the function being called, and `Î£` ||Arity|| to the number of arguments passed.
> {Î±+Î²/2}â†’avg 3:avg7 â‰¡ 5
the inside of a function creates a scope, and any variables created inside the scope will not be visible once the function returns.
> 123{Î±*2â†’double .double-1} â‰¡ 135
> 123{Î±*2â†’double .double-1}Â· .double â‰¡ â– 
when a function is created, all of the variables that it references as a value will be captured (lexical scope). this capture is immutable; if you change the value of a capture, it will only be changed in that function's scope.
> 123â†’l{l,Î±â†”l}â†’append 4:appendÂ· l â‰¡ 123
there are two ways of changing this, both equivalent: not referencing the value (as ||Mutate Statement|| can take a function), or deleting the capture. then it will look for an `l` in the caller scope (dynamic scope); the variable you reference must be in scope and there must not be any other variable with the same name in the same scope.
> 123â†’l{,Î±â†”l}â†’append 4:appendÂ· l â‰¡ 1234
> 123â†’l{â†’l l,Î±â†”l}â†’append 4:appendÂ· l â‰¡ 1234
> 123â†’l{,Î±â†”l}â†’append 0{"things"â†’l 4:appendÂ· l} â‰¡ "thingsâ™¦"  ' oops!
the braces don't need to be closed at the end of file.
---
:char: |
:type: verb
#2 Or
compute boolean OR of Î± and Î²; return 1 if one of Î± and Î² are nonzero, otherwise 0. scalar.
> 0|0 â‰¡ 0
> 0|1 â‰¡ 1
> 1|0 â‰¡ 1
> 1|1 â‰¡ 1
see also: ||And||, ||Minimum||
#1 Any
return 1 if any item in Î± is nonzero. equivalent to `â•§&#x7C;0`
> 10101011101| â‰¡ 1
> 11111111111| â‰¡ 1
> 00000000000| â‰¡ 0
for an empty list, this is always 0:
> Ï†| â‰¡ 0
see also: ||Or||, ||All||
---
:char: }
:type: grammar
#{abc} End Function
closing counterpart of ||Define Function||.
---
:char: ~
:type: verb
#1 Length
get the length of Î±. equivalent to `â–¬@`.
> 1111~ â‰¡ 4
> (12)(34)(56)~ â‰¡ 3
> Ï†~ â‰¡ 0
scalars have a length of 1, and functions have a length of ||Infinity||.
> 3~ â‰¡ 1
> .â–º~ â‰¡ âˆž
see also: ||Shape||, ||Depth||
#2 Not Equals
same as `=Â¬`. scalar.
> 5~3 â‰¡ 1
> 3~3 â‰¡ 0
> 3~5 â‰¡ 1
see also: ||Equals||, ||Not Matches||
---
:char: âŒ‚
:ascii: 'ex
:type: verb
#1 Exit
exits the program. if Î± is an integer, it will be the return code; otherwise, Î± will be printed as a string before exiting.
---
:char: Ã‡
:ascii: 'c+
:type: verb
#1 Uppercase
returns Î±, uppercasing it if in the range 'a'..'z'. scalar.
> "UPPERCASE"Ã‡ â‰¡ "UPPERCASE"
> "lowercase"Ã‡ â‰¡ "LOWERCASE"
> "Bees, bees"Ã‡ â‰¡ "BEES, BEES"
> "mOcKiNg"Ã‡ â‰¡ "MOCKING"
see also: ||Lowercase||
---
:char: Ã¼
:ascii: 'u"
:type: verb
#1 Complex Conjugate
returns Î±, changing the sign of the imaginary part
> 2Ã­3Ã¼ â‰¡ _2Ã­3
> Î˜Ã­4Ã¼ â‰¡ 1Ã­4
> 2Ã¼ â‰¡ 2
#2 Group
pair up the elements of Î± and Î², and returns a new list where each element in Î± appears in the Î²th element, in order. the fill will be the ||Empty List||. if Î² is ||None||, the element will be ignored.
> "vemf programming language"Ã¼0000â– 11111112222â– 33333333 â‰¡ "vemf""program""ming""language"â–Ï†
> 123456789Ã¼012012012 â‰¡ (147)(258)(369)â–Ï†
> "bee bumblebee honeybee"Ã¼000Ï†111111000Ï†11111000 â‰¡ "beebeebee""bumblehoney"â–Ï†
> "eastern bumblehoneybee"Ã¼2222222211111122222(012)(012)(012) â‰¡ "bee""bumblebee""eastern honeybee"â–Ï†
---
:char: Ã©
:ascii: 'e'
:type: verb
#1 Bits
get the internal representation of the integer Î±. this will be a 64-element list of bits with fill 0. scalar.
> :3054Ã© â‰¡ 0000000000000000000000000000000000000000000000000000101111101110â–0
#2 Encode Base
encodes the number Î± into the base Î² as a list, without any trailing zeros and 0 fill. scalar.
> :314Ã©Î¦ â‰¡ 314â–0
> :1000Ã©Î¦ â‰¡ 1000â–0
> :314Ã©2 â‰¡ 100111010â–0
> 0Ã©3 â‰¡ Ï†â–0
> :16â†•Ã©4â•›â†“2 â‰¡ â”‚00â”‚01â”‚02â”‚03â”‚10â”‚11â”‚12â”‚13â”‚20â”‚21â”‚22â”‚23â”‚30â”‚31â”‚32â”‚33
see also: ||Represent Base||, ||Decode Base||
---
:char: Ã¢
:ascii: 'a^
:type: verb
#1 Tangent
calculate `tan Î±`. scalar.
> 0Ã¢ Â± 0
> Ï€/6Ã¢ Â± 3âˆš/3
> Ï€/4Ã¢ Â± 1
> Ï€/3Ã¢ Â± 3âˆš
> Ï€/2Ã¢ Â± â– 
> Ï€Ã¢ Â± 0
> Ï€*3Â½Ã¢ Â± â– 
> Ï€*2Ã¢ Â± 0
#2 Bitwise And
calculate bitwise AND of integers Î± and Î². scalar.
> (0011Ã¨)Ã¢(0101Ã¨) â‰¡ 0001Ã¨
> :3054Ã¢:255 â‰¡ :238
---
:char: Ã¤
:ascii: 'a"
:type: verb
#1 Arctangent
calculate `arctan Î±` or `tanâ»Â¹ Î±`. scalar.
> 0Ã¤ Â± 0
> 3âˆšÃ¤ Â± Ï€/3
> 1Ã¤ Â± Ï€/4
#2 Nand
calculate boolean NAND of Î± and Î². scalar. equivalent to `&Â¬`
> 0Ã¤0 â‰¡ 1
> 0Ã¤1 â‰¡ 1
> 1Ã¤0 â‰¡ 1
> 1Ã¤1 â‰¡ 0
---
:char: Ã 
:ascii: 'a`
:type: verb
#2 Sample
get a simple random sample of the list Î± of length Î²; that is, take Î² distinct elements randomly from Î±.
> "sample"Ã 4 ?â‰¡ "smae"
> "sample"Ã 4 ?â‰¡ "esal"
> "sample"Ã 2 ?â‰¡ "em"
if Î² is the length of Î±, this is effectively a shuffle, which is what Ã  does monadically:
> "sample"Ã 6 ?â‰¡ "mpesla"
#1 Shuffle
shuffle the elements from Î±
> "sample"Ã  ?â‰¡ "lspeam"
---
:char: Ã¥
:ascii: 'ao
:type: verb
#1 Choice
pick a random element in Î±
> "pick"Ã¥ ?â‰¡ `c
> "pick"Ã¥ ?â‰¡ `k
#2 Choices
pick Î² elements from Î±, putting them in a list. Î²-pervasive.
> "pick"Ã¥3 ?â‰¡ "ikk"
> "pick"Ã¥Î¦ ?â‰¡ "ikcipckikc"
these might repeat; see ||Sample||
---
:char: Ã§
:ascii: 'c,
:type: verb
#1 Lowercase
return Î±, lowercasing it if in the range 'A'..'Z'. scalar.
> `AÃ§ â‰¡ `a
> "UPPERCASE"Ã§ â‰¡ "uppercase"
> "lowercase"Ã§ â‰¡ "lowercase"
> "Bees, bees"Ã§ â‰¡ "bees, bees"
> "mOcKiNg"Ã§ â‰¡ "mocking"
see also: ||Uppercase||
---
:char: Ãª
:ascii: 'e^
:type: verb
#1 Encode Codepage
convert Unicode codepoint Î± into the vemf codepage, or ||None|| if not possible. scalar.
> :8226:9829:9786:402`eÃª â‰¡ "â€¢â™¥â˜ºÆ’e"
#2 Encode
represent Î± in the radix system Î² in big-endian order. Î±-pervasive. we can use this, for example, for converting to hours, minutes, and seconds:
>   :4000Ãª:24:60:60 â‰¡ :0:1:6:40
>   :3200Ãª:24:60:60 â‰¡ :0:0:53:20
> :140000Ãª:24:60:60 â‰¡ :1:14:53:20
note that the result has one more item than Î² for the remainder. you can remove it with ||Behead|| if you want
> :12345ÃªÎ¦Î¦Î¦Î¦Î¦Î¦â™‚ â‰¡ 012345
> :1234567ÃªÎ¦Î¦Î¦Î¦Î¦Î¦â™‚ â‰¡ 234567
encode is also useful as a divmod
> :123.45Ãª:10 Â± :12:3.45
> :123.45Ãª1 Â± :123:0.45
#_1 Encode UTF-8
represent a string as a UTF-8 list of bytes, converting invalid values to ï¿½ U+FFFD REPLACEMENT CHARACTER.
> `a:269:676:1062:8224:30340:128238:69685_Ãª â‰¡ "aâ”€Ã¬â•©Ã±â•¨ÂªÎ“Ã‡Ã¡Ï„ÃœÃ¤â‰¡Æ’Ã´Â«â‰¡Ã¦Ã‡â•¡"
---
:char: Ã«
:ascii: 'e"
:type: verb
#1 Decode Codepage
convert characters from vemf codepage into Unicode, or ||None|| if not possible. scalar.
> "â€¢â™¥â˜ºÆ’e"Ã« â‰¡ :8226:9829:9786:402`e
#2 Decode
decode Î± from the radix system Î² in big-endian order. this is an inverse of ||Encode||
> 0:1:6:40Ã«:24:60:60 â‰¡ :4000
> :1:6:40Ã«:24:60:60 â‰¡ :4000
> :12:3.45Ã«:10 Â± :123.45
> :123:0.45Ã«1 Â± :123.45
#_1 Decode UTF-8
converts a list of bytes into a string, converting invalid sequences to ï¿½ U+FFFD REPLACEMENT CHARACTER.
> "aâ”€Ã¬â•©Ã±â•¨ÂªÎ“Ã‡Ã¡Ï„ÃœÃ¤â‰¡Æ’Ã´Â«â‰¡Ã¦Ã‡â•¡"_Ã« â‰¡ `a:269:676:1062:8224:30340:128238:69685
---
:char: Ã¨
:ascii: 'e`
:type: verb
#2 Decode Base
converts a list Î± from positional base Î², in little-endian order. Î²-pervasive.
> 3054Ã¨Î¦ â‰¡ :3054
see also: ||Encode Base||, ||Parse Base||
#1 Decode Binary
use 2 as the base
> 0101Ã¨ â‰¡ 5
> 101111101110Ã¨2 â‰¡ :3054
---
:char: Ã¯
:ascii: 'i"
:type: verb
#1 Arcsine
calculate `arcsin Î±` or `sinâ»Â¹ Î±`. scalar.
> Î˜Ã¯ Â± Ï€Â½-
> 0Ã¯ Â± 0
> 1Ã¯ Â± Ï€Â½
#2 Xor
calculate boolean XOR of Î± and Î². scalar. equivalent to `âŒâ•‘~`
> 0Ã¯0 â‰¡ 0
> 0Ã¯1 â‰¡ 1
> 1Ã¯0 â‰¡ 1
> 1Ã¯1 â‰¡ 0
---
:char: Ã®
:ascii: 'i^
:type: verb
#1 Sine
calculate `sin Î±`. scalar.
> 0Ã® Â± 0
> Ï€/6Ã® Â± 1Â½
> Ï€/4Ã® Â± 2âˆšÂ½
> Ï€/3Ã® Â± 3âˆšÂ½
> Ï€/2Ã® Â± 1
> Ï€Ã® Â± 0
> Ï€*3Â½Ã® Â± Î˜
> Ï€*2Ã® Â± 0
#2 Bitwise Xor
calculate bitwise XOR of Î± and Î². scalar.
> (0011Ã¨)Ã®(0101Ã¨) â‰¡ 0110Ã¨
> :3054Ã®8 â‰¡ :3046
---
:char: Ã¬
:ascii: 'i`
:type: verb
#1 Cis
calculate `cis Î±` or `exp(i*Î±)`. scalar.
> 0Ã¬ Â± 1
> Ï€Â½Ã¬ Â± 1Ã­
> Ï€Ã¬ Â± Î˜
> Ï€-Â½Ã¬ Â± Î˜Ã­
#2 From Polar
calculate `Î² * cis Î±` or `Î²*exp(i*Î±)`. this is the same as converting from the polar form where `Î± = Ï†` (the argument) and `Î² = r` (the modulus or magnitude or absolute value). scalar.
> Ï€Â½Ã¬2 Â± 2Ã­
> Ï€/4Ã¬(2âˆš) Â± 1Ã­1
---
:char: Ã„
:ascii: 'a+
:type: verb
#1 Argument
get the argument (or phase or angle) of the complex number Î±. scalar.
> 2Ã„ â‰¡ 0
> 2Ã­Ã„ â‰¡ Ï€Â½
> _2Ã„ â‰¡ Ï€
> _2Ã­Ã„ â‰¡ Ï€Â½-
> 2Ã­2Ã„ â‰¡ Ï€/4
#2 Atan2
calculate atan2(Î±, Î²). equivalent to `Ã­Ã„`. scalar.
> 0Ã„2 â‰¡ 0
> 2Ã„0 â‰¡ Ï€Â½
> 0Ã„_2 â‰¡ Ï€
> _2Ã„0 â‰¡ Ï€Â½-
---
:char: Ã…
:ascii: 'aO
:type: verb
#1 Radians
converts Î± radians to degrees. equivalent to `*â”œ:180/Ï€`. scalar.
> 2*Ï€Ã… â‰¡ :360
> Ï€Ã… â‰¡ :180
> Ï€Â½Ã… â‰¡ :90
> Ï€Â¼Ã… â‰¡ :360
#2 Absolute Difference
calculate the absolute difference of Î± and Î². equivalent to `-Â¢`. scalar.
> 3Ã…5 â‰¡ 2
> 5Ã…3 â‰¡ 2
> Î¦â†•Ã…3 â‰¡ 3210123456
---
:char: Ã‰
:ascii: 'e+
:type: verb
#1 Is Scalar
returns 1 if Î± is a scalar, otherwise 0. equivalent to `ÎµÂ¬`
> 4Ã‰ â‰¡ 1
> 456Ã‰ â‰¡ 0
> (â–²)Ã‰ â‰¡ 0
see also: ||Is List||
#2 Excludes
for every item in the list Î±, check if it is not in Î². equivalent to `ÎµÂ¬`
> 0123456789Ã‰012073167140 â‰¡ 0000010011
> 1 Ã‰ 012073167140 â‰¡ 0
> 5 Ã‰ 012073167140 â‰¡ 1
> "unauthorized equation"Ã‰"aeiou" â‰¡ 010011010101101001001
see also: ||Includes||
---
:char: Ã¦
:ascii: 'ae
:type: verb
#2 Join
join the lists in Î± with the separator Î²
> "bee""bees""apioids"Ã¦` â—„ â‰¡ "bee bees apioids"
> 123ÂªÃ¦", " â‰¡ "1, 2, 3"
> "Hello"Ã¦`f â‰¡ "Hfeflflfo"
---
:char: Ã†
:ascii: 'aE
:type: verb
#1 Expand
turn Î± into an infinite list, where the items outside the list are Î±'s fill. equivalent to `{â”´@Î±}`
> 123~ â‰¡ 3
> 123Ã†~ â‰¡ âˆž
> 123â•’+45 â‰¡ 57
> 123â•’+(45â–0) â‰¡ 57
> 123â•’+(45â–0Ã†) â‰¡ 573
> 123â•’+(45Ã†) â‰¡ 57â– 
---
:char: Ã´
:ascii: 'o^
:type: verb
#1 Cosine
calculate `cos Î±`. scalar.
> 0Ã´ Â± 1
> Ï€/6Ã´ Â± 3âˆšÂ½
> Ï€/4Ã´ Â± 2âˆšÂ½
> Ï€/3Ã´ Â± 1Â½
> Ï€/2Ã´ Â± 0
> Ï€Ã´ Â± Î˜
> Ï€*3Â½Ã´ Â± 0
> Ï€*2Ã´ Â± 1
#2 Bitwise Or
calculate bitwise OR of integers Î± and Î². scalar.
> (0011Ã¨)Ã´(0101Ã¨) â‰¡ 0111Ã¨
---
:char: Ã¶
:ascii: 'o"
:type: verb
#1 Arccosine
calculate `arccos Î±` or `cosâ»Â¹ Î±`. scalar.
> Î˜Ã¶ Â± Ï€
> 0Ã¶ Â± Ï€Â½
> 1Ã¶ Â± 0
#2 Nor
compute boolean NOR of Î± and Î². scalar. equivalent to `&#x7c;Â¬`.
> 0Ã¶0 â‰¡ 1
> 0Ã¶1 â‰¡ 0
> 1Ã¶0 â‰¡ 0
> 1Ã¶1 â‰¡ 0
---
:char: Ã²
:ascii: 'o`
:type: verb
#1 Eval
evaluate the codepage string Î± in the current context, and return the value
> "1+1"Ã² â‰¡ 2
it will have access to all defined variables in the enclosing scopes, all the input and output streams and the random number generator. don't use this from untrusted sources blah blah blah blah.
> 4â†’valueÂ· "6â†”value"Ã²Â· .value â‰¡ 6
---
:char: Ã»
:ascii: 'u^
:type: verb
#1 Occurence Count
for every element of Î±, count the number of occurences of that element in the prefix before that element.
> 320110433250Ã» â‰¡ 000011012102
therefore, `Ã»Â¬` detects if an element is the first in the array:
> 320110433250Ã»Â¬ â‰¡ 111100100010
> 320110433250(Ã»Â¬)â•“â€¼ â‰¡ 320145  ' same as Î±âˆ©
#2 Unique Index Of
for every element in Î², find the index of the first unused match in Î±, or ||None||.
> 22235 Ã» 223357 â‰¡ 013â– 4â– 
> 3333 Ã» 3323 â‰¡ 01â– 2
---
:char: Ã¹
:ascii: 'u`
:type: verb
#1 Real Part
get the real part of a complex number Î±. scalar.
> 3Ã­4Ã¹ â‰¡ 4
> 3Ã¹ â‰¡ 3
#2 Count
count the number of occurences of Î² in Î±. Î²-pervasive.
> 012073167140Ã¹0123456789 â‰¡ 3311101200
---
:char: Ã¿
:ascii: 'y"
:type: verb
#1 Deindices
a list of length `Î±Ã‘` with fill 0, where the value of an element `i` is the amount of occurences of `i` in Î±
> 134679Ã¿ â‰¡ 0101101101â–0
> 02244455557Ã¿ â‰¡ 10203401â–0
> 75420542545Ã¿ â‰¡ 10203401â–0
---
:char: Ã–
:ascii: 'o+
:type: verb
#2 Write
write a string Î±, UTF-8 encoded, to output stream Î². returns the number of bytes written, or ||None|| if there was some IO error.
#1 Write Stdout
write a string Î± to output stream 0. equivalent to `Ã–0`.
see also: ||Print||
#_2 Write Bytes
write a list of bytes Î± to output stream Î². returns the number of bytes written, or ||None|| if there was some IO error.
#_1 Write Bytes to Stdout
write a list of bytes Î± to output stream 0. equivalent to `_Ã–0`.
---
:char: Ãœ
:ascii: 'u+
:type: verb
#2 Read
read Î± bytes from input stream Î² and decode them from UTF-8. invalid sequences are replaced with ï¿½ U+FFFD REPLACEMENT CHARACTER.
for `Î±=âˆž`, read until the end of file. for `Î±=Î˜`, read until the next line break (0x0A byte).
may return ||None|| in case of an IO error.
#1 Read Stdin
read from input stream 0. equivalent to `Ãœ0`.
#_2 Read Bytes
read Î± bytes from input stream Î².
for `Î±=âˆž`, read until the end of file. for `Î±=Î˜`, read until the next line break (0x0A byte).
may return ||None|| in case of an IO error.
#_1 Read Bytes from Stdin
read from input stream 0. equivalent to `_Ãœ0`.
---
:char: Â¢
:ascii: 'C
:type: verb
#1 Absolute
get the absolute value of Î±. for complex numbers, this is the magnitude or modulus. scalar.
> 5Â¢ â‰¡ 5
> 0Â¢ â‰¡ 0
> _4Â¢ â‰¡ 4
> 3Ã­4Â¢ â‰¡ 5
#2 Distance
calculate `Î±Â²+(Î²Â²)âˆš`, or the distance of (Î±, Î²) to the origin (0, 0), or the absolute value of `Î±Ã­Î²`. scalar
> 3Â¢4 â‰¡ 5
> 8Â¢6 â‰¡ :10
> 1Â¢1 â‰¡ 2âˆš
---
:char: Â£
:ascii: 'fd
:type: verb
#2 Find
finds all non-overlapping occurances of sublist Î² in Î±. returns a list of the same length as Î±, where the matches are represented as increasing indices of the sublist, and non-matches are ||None||. if Î² is a scalar or the ||Empty List||, search for the element Î².
> "sus sus amongus"Â£`s    â‰¡ 0â– 0â– 0â– 0â– â– â– â– â– â– â– 0
> "sus sus amongus"Â£"s"   â‰¡ 0â– 0â– 0â– 0â– â– â– â– â– â– â– 0
> "sus sus amongus"Â£"us"  â‰¡ â– 01â– â– 01â– â– â– â– â– â– 01
> "sus sus amongus"Â£"us " â‰¡ â– 012â– 012â– â– â– â– â– â– â– 
> "sus sus amongus"Â£"sus" â‰¡ 012â– 012â– â– â– â– â– â– â– â– 
> "bee beebeee beebe"Â£"ee"  â‰¡ â– 01â– â– 01â– 01â– â– â– 01â– â– 
> "bee beebeee beebe"Â£"bee" â‰¡ 012â– 012012â– â– 012â– â– 
this is similar to using ||Scan Windows|| and ||Matches|| `Î±(â–º~)â•«â‰¡Î²` but this does not include overlapping matches
> "asininity"Â£"ini" â‰¡ â– â– 012â– â– â– â– 
> "asininity"(â–º~)â•«â‰¡ "ini" â‰¡ 0010100  ' two matches!
its format is also a bit more convenient: same length as the original string, and you can do `=0` to find the starts of matches or ||Is Some|| `â–€` to find all the matched characters:
> "sus sus amongus"Â£"sus"   â‰¡ 012â– 012â– â– â– â– â– â– â– â– 
> "sus sus amongus"Â£"sus"=0 â‰¡ 100010000000000
> "sus sus amongus"Â£"sus"â–€  â‰¡ 111011100000000
see also: ||Equals||, ||Scan Windows||, ||Split||
---
:char: Â¥
:ascii: 'Y
:type: verb
#2 Split
splits a list Î± at all the ocurrences of the sublist Î²
> "bee bees apioids"Â¥` â—„ â‰¡ "bee""bees""apioids"
> "bee bees apioids"Â¥`,  â‰¡ â™ª"bee bees apioids"
> "one, two, three"Â¥", " â‰¡ "one""two""three"
see also: ||Find||
#1 Split Newlines
splits at newlines (byte 0x0A). same as `Â¥Î¦`. won't strip out carriage returns.
---
:char: â‚§
:ascii: 'pt
:type: verb
#2 Partition
partition the list Î± at indexes Î²
> 0123456789â‚§46 â‰¡ (0123)(45)(6789)
> 0123456789â‚§0469Î¦ â‰¡ ()(0123)(45)(678)(â™ª9)()
#1 Parts
get a list of the real and imaginary parts of Î±. scalar. equivalent to `â””Ã¹â™«Ãº`
> 4Ã­_2 â‚§ â‰¡ _2 4
> 4â‚§ â‰¡ 4 0
> 456_30Ã­_2_3024â‚§ â‰¡ â”‚_24â”‚_35â”‚06â”‚2_3â”‚40
---
:char: Æ’
:ascii: 'F 'f,
:type: verb_variable
#12 Self
the function being executed. if not in a function definition, undefined. useful for recursive functions.
> 6{=0?1â—˜Î±â–¼Æ’*Î±} â‰¡ :720
you shouldn't need this very often; in this case, `â†¨*` or `!` would have been enough. remember to include an exit condition using ||Return||. 
---
:char: Ã¡
:ascii: 'a'
:type: verb
#1 Pick
pick a random integer in the range [0, Î±). scalar.
> 5Ã¡ ?â‰¡ 3
> 5Ã¡ ?â‰¡ 2
> 5Ã¡ ?â‰¡ 4
> 5Ã¡ ?â‰¡ 0
if Î± is 0 or lower, pick a floating point value in the range [0, 1)
> 0Ã¡ ?â‰¡ :0.6902543350466662
#2 Picks
pick Î² times. this is the same as doing `Î±Â§Î²Ã¡`
> 5Ã¡Î¦ ?â‰¡ 4 3 2 2 0 2 1 0 3 3
> 5Ã¡:100<5& â‰¡ 1
---
:char: Ã­
:ascii: 'i'
:type: verb
#1 Imaginary
calculate `Î±*i`, where `i` is the imaginary unit. scalar.
> 1Ã­ â‰¡ Î“
> 3Ã­ â‰¡ 3*Î“
#2 Complex
calculate `Î² + Î±*i`. scalar.
> 1Ã­Â² Â± _1
> 2Ã­Â² Â± _4
> 3Ã­2Â² Â± :12Ã­_5
---
:char: Ã³
:ascii: 'o'
:type: verb
#1 Signs
calculate (âˆ’1)^Î±. if Î± is an integer, this means âˆ’1 for odd Î±, and 1 for even Î±. scalar. equivalent to `â”´^Î˜`
> 012345Ã³ â‰¡ 1Î˜1Î˜1Î˜
see also: ||Minus One||
#2 Divides
return 1 if Î± is divisible by Î², otherwise 0. scalar. equivalent to `%Â¬`
> 0Ã³3 â‰¡ 1
> 1Ã³3 â‰¡ 0
> 2Ã³3 â‰¡ 0
> 3Ã³3 â‰¡ 1
> :20â†•Ã³4 â‰¡ 10001000100010001000
see also: ||Remainder||
---
:char: Ãº
:ascii: 'u'
:type: verb
#1 Imaginary Part
get the imaginary part of a complex number Î±. scalar.
> 3Ã­4Ãº â‰¡ 3
> 3Ãº â‰¡ 0
#2 Index of Last
find the last exact match in the list and return its index, or else ||None||. Î²-pervasive.
> 012073167140Ãº0123456789 â‰¡ :11 925Î¦â– 78â– â– 
---
:char: Ã±
:ascii: 'n- 'n~
:type: verb
#2 Minimum
return the lowest number between Î± and Î². scalar.
> 0Ã±2 â‰¡ 0
> _3Ã±0 â‰¡ _3
> _2Ã±2 â‰¡ _2
> 1Ã±5 â‰¡ 1
#1 Infimum
return the lowest number in Î±. equivalent to `â•§Ã±âˆž`
> 2398389292Ã± â‰¡ 2
for an empty list, this returns infinity.
> Ï†Ã± â‰¡ âˆž
---
:char: Ã‘
:ascii: 'n+
:type: verb
#2 Maximum
return the largest number between Î± and Î². scalar.
> 1Ã‘2 â‰¡ 2
> _2Ã‘3 â‰¡ 3
> _2Ã‘0 â‰¡ 0
#1 Supremum
return the greatest number in Î±. equivalent to `â•§Ã‘_âˆž`
> 381562124Ã‘ â‰¡ 8
for an empty list, this returns negative infinity.
> Ï†Ã‘ â‰¡ âˆž-
---
:char: Âª
:ascii: 'a,
:type: verb
#1 Represent
convert the number Î± to a string. scalar.
> :123Âª â‰¡ "123"
> :123.45Âª â‰¡ "123.45"
> 4Ã­3Âª â‰¡ "3+4i"
see also: ||Parse||
#2 Represent Base
convert the number Î± to a string in base Î², using the characters ||`0`-`9` and `a`-`z`@Digits and Lowercase Letters||. unspecified behaviour for bases not in [2, 36]. scalar.
> :35Âª2 â‰¡ "100011"
> :42ÂªÎ¦ â‰¡ "42"
> :3054Âª:16 â‰¡ "bee"
> :14774Âª:36 â‰¡ "bee"
> :42405Âª:16 â‰¡ "a5a5"
> :-42405Âª:16 â‰¡ "-a5a5"
> 0Âª:16 â‰¡ "0"
see also: ||Parse Base||, ||Encode Base||
---
:char: Âº
:ascii: 'o,
:type: verb
#1 Parse
convert the string/character Î± to a number, or ||None||
> `4Âº â‰¡ 4
> "123"Âº â‰¡ :123
> "123.45"Âº â‰¡ :123.45
> "123+5i"Âº â‰¡ 5Ã­:123
see also: ||Represent||
#2 Parse Base
convert the string Î± in base Î² to a number. behaviour unspecified for bases not in [2, 36].
> "bee"Âº:16 â‰¡ :3054
> "bee"Âº:36 â‰¡ :14774
> "A5A5"Âº:16 â‰¡ :42405
see also: ||Represent Base||, ||Decode Base||
---
:char: Â¿
:ascii: '?
:type: verb
#1 Diagonal
get the diagonal of length `Î±â–¬2Ã±` of a list Î±
> "bus""red""are"Â¿ â‰¡ "bee"
> .â–ºâ†‘55Â¿ â‰¡ :0:6:12:18:24
> (100)(020)(003)Â¿ â‰¡ 123
#2 Select
index Î± with every item in Î². equivalent to `â•˜@`.
> "abc""def""ghi"Â¿(22)(10)(11)(00) â‰¡ "idea"
---
:char: âŒ
:ascii: '_ 'bl
:type: verb
#1 Bool
returns 1 if `Î±~0`, otherwise 0. scalar.
> 0âŒ â‰¡ 0
> 1âŒ â‰¡ 1
> 3âŒ â‰¡ 1
> 2-âŒ â‰¡ 1
#2 Prepend
returns the list Î± with the item Î² added to the front.
> 123âŒ4 â‰¡ 4123
> 123âŒ456 â‰¡ (456)123
see also: ||Procatenate||, ||Append||
---
:char: Â¬
:ascii: '-
:type: verb
#1 Not
returns 1 if `Î±=0`, otherwise 0. scalar
> 0Â¬ â‰¡ 1
> 1Â¬ â‰¡ 0
> 3Â¬ â‰¡ 0
> 2-Â¬ â‰¡ 0
#2 Append
returns the list Î± with the item Î² added to the back.
> 123Â¬4 â‰¡ 1234
> 123Â¬456 â‰¡ 123(456)
see also: ||Concatenate||, ||Prepend||
---
:char: Â½
:ascii: 'hf
:type: verb
#1 Halve
equivalent to `/2`. scalar.
> 1Â½ â‰¡ :0.5
> 5Â½ â‰¡ :2.5
> 1Â½Â½ â‰¡ :0.25
#2 Lowest Common Denominator
calculates the ||lowest common denominator@https://en.wikipedia.org/wiki/Lowest_common_denominator|| of two integers Î± and Î², or lcd(Î±, Î²). scalar.
> :12Â½:18 â‰¡ :36
> :30Â½:45 â‰¡ :90
---
:char: Â¼
:ascii: 'db
:type: verb
#1 Double
equivalent to `*2`. scalar.
> 1Â¼ â‰¡ 2
> Î¦Â¼ â‰¡ :20
> 5Â¼ â‰¡ :10
> 6Â½Â¼ â‰¡ 6
#2 Greatest Common Divisor
calculates the ||greatest common divisor@https://en.wikipedia.org/wiki/Greatest_common_divisor|| of two integers Î± and Î², or gcd(Î±, Î²). scalar.
> 8Â¼:12 â‰¡ 4
> :30Â¼:45 â‰¡ :15
---
:char: Â¡
:ascii: '@ 'ie
:type: verb
#1 Last
get the last element of the list in Î±
> "aeiou"Â¡ â‰¡ `u
> 123Â¡ â‰¡ 3
#2 Translate
index the array Î± for every scalar in Î±. equivalent to `_â•›â”´@`.
> 13524Â¡" aeiouy" â‰¡ "aiueo"
---
:char: Â«
:ascii: 'rl
:type: verb
#2 Rotate Left
moves the last Î² elements of the list Î± to the front. Î²-pervasive.
> 12345Â«1 â‰¡ 23451
> 12345Â«3 â‰¡ 45123
> 12345Â«5 â‰¡ 12345
> 12345Â«6 â‰¡ 23451
if Î² is negative, this acts like ||Rotate Right||.
> 12345Â«_3 â‰¡ 34512
#1 Rotate Left Once
equivalent to `Â«1`
> 12345Â« â‰¡ 23451
---
:char: Â»
:ascii: 'rr
:type: verb
#2 Rotate Right
moves the first Î² elements of the list Î± to the back. Î²-pervasive.
> 12345Â»1 â‰¡ 51234
> 12345Â»3 â‰¡ 34512
> 12345Â»5 â‰¡ 12345
> 12345Â»6 â‰¡ 51234
if Î² is negative, this acts like ||Rotate Left||.
> 12345Â»_3 â‰¡ 45123
#1 Rotate Right Once
equivalent to `Â»1`
> 12345Â» â‰¡ 51234
---
:char: â–‘
:ascii: 'l2
:type: literal
#â–‘â˜ºâ˜» Short Literal
shorthand for an ||Integer Literal|| with 2 bytes (same as `â–ˆ2`)
---
:char: â–’
:ascii: 'l3
:type: literal
#â–’â˜ºâ˜»â™¥ Long Literal
shorthand for an ||Integer Literal|| with 3 bytes (same as `â–ˆ3`)
---
:char: â–“
:ascii: 'c2
:type: literal
#â–“ab Digraph Literal
a 2 character literal.
> â–“() â‰¡ `(`)
> â–“012 â‰¡ (`0`1)2
see also: ||Character Literal||
---
:char: â–ˆ
:ascii: 'il
:type: literal
#â–ˆ4â˜ºâ˜»â™¥â™¦ Integer Literals
a convenient literal syntax for large integers by specifying their bytes. integer literals are length-prefixed: after the `â–ˆ` there will be a digit from 1 to 8 that specifies the number of bytes of the integer. `â–‘` ||Short Literal||s and `â–’` ||Long Literal||s are equivalent to `â–ˆ2` and `â–ˆ3` respectively.
an example: `â–ˆ3â˜»â™¥â™¦` is the number `131844`. the number after the `â–ˆ` is 3, so it will read three bytes. those bytes are `â˜»` `â™¥` `â™¦`, which means the output will be 0x020304, or `2*256^2 + 3*256 + 4`, or 131844.
> â–ˆ3â˜»â™¥â™¦ â‰¡ :131844
> â–ˆ3â˜»â™¥â™¦ â‰¡ 2*(:256^2) + (3*:256) + 4
`â–’` can also be used here:
> â–’â˜»â™¥â™¦ â‰¡ :131844
let's represent the number 123456789. we can either use the ||Base Encode|| function: 
> :123456789Ã©:256 â‰¡ :7:91:205:21â–0
alternatively, get the raw ||Bits|| of the number, partition it into ||Chunks|| of 8 bits, and ||Decode Binary|| them:
> :123456789Ã©â™¥8â••Ã¨ â‰¡ :0:0:0:0:7:91:205:21
we can represent the bytes as a codepage string (see ||Format||):
>     :7:91:205:21â¿5â˜»Â·
> "â€¢[â•Â§"
if we try it out,
> â–ˆ4â€¢[â•Â§ â‰¡ :123456789
byte literals support negative numbers as well, using the two's complement when the first byte is over 127. `â–‘Â²Â²` is not `253*256 + 253` or 64009, it's `65536 - 64009` or âˆ’515.
> â–‘Â²Â² â‰¡ :-515
integers in vemf are represented with signed two's-complement integers, so this is the same as making all the other bytes 0xFF
> â–‘Â²Â²Ã©â™¥8â••Ã¨ â‰¡ :255:255:255:255:255:255:253:253
`â–ˆ` is mostly useful when using large numbers. if your number happens to be a vemf constant or has a trivial computation, use that instead.
see also: ||Short Literal||, ||Long Literal||, ||Character Literal||, ||Digraph Literal||
---
:char: â–„
:ascii: 'hd
:type: verb
#1 Is None
1 if Î± is none, otherwise 0. scalar.
> â– â–„ â‰¡ 1
> 12â– 456â– 78â–„ â‰¡ 001000100
see also: ||Is Some||
#2 Denullify
if Î² is not 0, return ||None||, otherwise Î±. scalar.
> 123456789â–„010103102 â‰¡ 1â– 3â– 5â– â– 8â– 
see also: ||Nullify||
---
:char: â–Œ
:ascii: 'hl
:type: verb
#1 Fill Holes
replace ||None||s in the list Î± with its fill. equivalent to `â–â•“â–Œ`
> 12â– 456â– 78â–0â–Œ â‰¡ 120456078â–0
> 12â– 456â– 78â–Œ â‰¡ 12â– 456â– 78
#2 Replace Holes
replace ||None||s in the list Î± with Î².
> 12â– 456â– 78â–Œ0 â‰¡ 120456078
note that this function is not pervasive:
> 12â– 45(0â– 2â– 4)6â– 7  â–Œ0 â‰¡ 12045(0â– 2â– 4)607
> 12â– 45(0â– 2â– 4)6â– 7_â••â–Œ0 â‰¡ 12045(00204)607
---
:char: â–
:ascii: 'hr
:type: verb
#1 Get Fill
gets the fill of the list Î±.
> 123â– â‰¡ â– 
#2 Set Fill
returns the list Î± with the fill changed.
> 123â–1â– â‰¡ 1
---
:char: â–€
:ascii: 'hu
:type: verb
#1 Is Some
check if Î± is not null. same as `Â¬â–„`. scalar.
> â– â–€ â‰¡ 0
> 1â–€ â‰¡ 1
> 12â– 456â– 78â–€ â‰¡ 110111011
see also: ||Is None||
#2 Nullify
if Î² is 0, return ||None||, otherwise Î±. scalar.
> 123456789â–€010103102 â‰¡ â– 2â– 4â– 67â– 9
see also: ||Denullify||
---
:char: Î±
:ascii: 'A
:type: variable
#0 Alpha
the left argument. if not in a function definition, the first argument passed in the command line, or `Î´@0`
> "left"{Î±Ã‡} â‰¡ "LEFT"
> "left"{Î±Ã‡}"right" â‰¡ "LEFT"
---
:char: Î²
:ascii: 'B
:type: variable
#0 Beta
the right argument. if not in a function definition, the second argument passed in the command line, or `Î´@1`. if the function was called monadically, this will be ||None||.
> "left"{Î²Ã‡} â‰¡ â– 
> "left"{Î²Ã‡}"right" â‰¡ "RIGHT"
---
:char: Î“
:ascii: 'g+
:type: noun
#0 Imaginary Unit
the ||imaginary Unit@https://en.wikipedia.org/wiki/Imaginary_unit|| i
> Î“ â‰¡ Î˜âˆš
> 3*Î“+2 â‰¡ 3Ã­2
#_0 Negative Imaginary Unit
the complex number -i, or `Î“-`
#.0 Eulerâ€“Mascheroni Constant
the number `0.5772156649015329`
---
:char: Ï€
:ascii: 'p- 'pi
:type: noun
#0 Pi
||pi@https://en.wikipedia.org/wiki/Pi||, archimedes constant, ratio of a semicircle to its radius, or at least the best approximation possible in 64-bit floating point.
> Ï€ â‰¡ :3.141592653589793
#_0 Tau
the number `6.283185307179586`, or `Ï€*2`
#.0 Half Pi
the number `1.5707963267948966`, or `Ï€/2`
---
:char: Î£
:ascii: 's+
:type: variable
#0 Arity
the number of arguments passed (1 or 2). if not in a function definition, the number of arguments passed in the command-line (`Î´~`, may not be 1 or 2).
---
:char: Ïƒ
:ascii: 's-
:type: noun
#0 Outer Alpha
references `Î±` from the outer scope. useful for defining adverbs or higher-order functions.
---
:char: Î¼
:ascii: 'm-
:type: noun
#0 Outer Beta
references `Î²` from the outer scope. useful for defining adverbs or higher-order functions.
---
:char: Î´
:ascii: 'd-
:type: noun
#0 Arguments
the list of arguments passed in the command line (not including the executable name, flags or the script filename)
---
:char: Î¦
:ascii: 'X 'f+
:type: noun
#0 Ten
the integer 10
> Î¦ â‰¡ :10
#_0 Minus Ten
the integer âˆ’10
> _Î¦ â‰¡ :-10
#.0 Euler's Number
||euler's number@https://en.wikipedia.org/wiki/E_(mathematical_constant)|| e, or the number `2.718281828459045`
> 1^ â‰¡ .Î¦
---
:char: Î˜
:ascii: 'Q 't+
:type: noun
#0 Minus One
the number âˆ’1
> Î˜ â‰¡ :-1
---
:char: Î´
:ascii: 'd-
:type: noun
#0 Arguments
the list of arguments passed in the command line (not including the executable name, flags or the script filename)
---
:char: âˆž
:ascii: 'if
:type: noun
#0 Infinity
positive infinity
> 5<âˆž â‰¡ 1
#_0 Negative Infinity
negative infinity
> 5>_âˆž â‰¡ 1
#.0 Maximum Integer
the maximum integer representable by a signed 64-bit integer, or `:9223372036854775807`
> .âˆžâ–² â‰¡ :9223372036854775807
> .âˆž  â‰¡ :9223372036854775807
> .âˆžâ–¼ â‰¡ :9223372036854775806
---
:char: Ï†
:ascii: 'Z 'f-
:type: noun
#0 Empty List
literal for an empty list with ||None|| fill
> Ï†~ â‰¡ 0
#.0 Golden Ratio
the number `1.618033988749895`, or `5âˆšâ–²Â½`
#_0
the number `-0.6180339887498949`, or `5âˆšâ–¼-Â½`
---
:char: Îµ
:ascii: 'in 'e-
:type: verb
#1 Is List
returns 0 if Î± is a scalar, otherwise 1
> 4Îµ â‰¡ 0
> 456Îµ â‰¡ 1
> (â–²)Îµ â‰¡ 1
see also: ||Is Scalar||
#2 Includes
for every item in the list Î±, check if it is in Î². equivalent to `â•›(â•˜â‰¡&#x7C;)`
> 0123456789Îµ012073167140 â‰¡ 1111101100
> 1 Îµ 012073167140 â‰¡ 1
> 5 Îµ 012073167140 â‰¡ 0
> "unauthorized equation"Îµ"aeiou" â‰¡ 101100101010010110110
> "unauthorized equation"(Îµ*:32-)â•“+"aeiou" â‰¡ "UnAUthOrIzEd EqUAtIOn"
see also: ||Excludes||
---
:char: âˆ©
:ascii: 'is
:type: verb
#1 Unique
remove duplicates from Î±
> 320110433250âˆ© â‰¡ 320145
#2 Intersection
return the items in list Î± that are not in Î²
> "hello world i am a vemf test"âˆ©`  â‰¡ "      "
> "hello world i am a vemf test"âˆ©"aeiou " â‰¡ "eo o i a a e e"
> "hello world i am a vemf test"âˆ©"aeiou" â‰¡ "eooiaaee"
---
:char: â‰¡
:ascii: '=
:type: verb
#1 Is Not Empty
returns 1 if the length of Î± is 0, otherwise 0
> 123â‰¡ â‰¡ 0
> Ï†â‰¡ â‰¡ 1
#2 Matches
returns 1 if the values Î± and Î² are equal. functions always return false.
> 123â‰¡123 â‰¡ 1
> 123â‰¡1234 â‰¡ 0
> (+)â‰¡(+) â‰¡ 0
see also: ||Equals||
---
:char: Â±
:ascii: '+
:type: verb
#1 Signum
returns the signum of Î±. this is âˆ’1 for negative numbers, 1 for positive numbers, and 0 for zero. for complex numbers, this is generalized as `Î±/abs(Î±)` or `Â¢â•“/`
> 5Â± â‰¡ 1
> 0Â± â‰¡ 0
> _3Â± â‰¡ Î˜
> 4Ã­Â± â‰¡ Î“
> 2Ã­2Â± â‰¡ Ï€/4Ã¬
#2 Approximately Equal
checks that the floating point numbers Î± and Î² are almost (more-or-less) equal. this is computed as a relative and absolute tolerance of 2 to the power of âˆ’32, or roughly `{Î±Â¢Î²/(1Î±Î² Â¢) â‰¤ (:32-%) &#x7C;}`
> 3Â±3 â‰¡ 1
> 3Â±:3.0000000001 â‰¡ 1
> 3Â±:3.001 â‰¡ 0
> 3Â±4 â‰¡ 0
see also: ||Matches||
---
:char: â‰¥
:ascii: '>
:type: verb
#1 Sort Down
sorts the list Î± in descending order
> 143042â‰¥ â‰¡ 443210
see also: ||Grade Down||, ||Sort Up||
#2 Greater Than Or Equal
return 1 if Î± â‰¥ Î², else 0. scalar. equivalent to `<Â¬`
> 5â‰¥3 â‰¡ 1
> 3â‰¥3 â‰¡ 1
> 3â‰¥5 â‰¡ 0
see also: ||Less Than Or Equal||, ||Greater Than||
#_2 Lexicographic Greater Than Or Equal
return 1 if Î± â‰¥ Î², else 0. if any of the two elements are lists, it will compare lexicographically. equivalent to `_<Â¬`
see also: ||Lexicographic Greater Than||, ||Lexicographic Less Than||
---
:char: â‰¤
:ascii: '<
:type: verb
#1 Sort Up
sorts the list Î± in ascending order
> 143042â‰¤ â‰¡ 012344
see also: ||Grade Up||, ||Sort Down||
#2 Less Than Or Equal
return 1 if Î± â‰¤ Î², else 0. scalar.
> 5â‰¤3 â‰¡ 0
> 3â‰¤3 â‰¡ 1
> 3â‰¤5 â‰¡ 1
see also: ||Greater Than Or Equal||, ||Less Than||
#_2 Lexicographic Greater Than Or Equal
return 1 if Î± â‰¤ Î², else 0. if any of the two elements are lists, it will compare lexicographically. equivalent to `_>Â¬`
see also: ||Lexicographic Less Than||, ||Lexicographic Greater Than||
---
:char: âŒ 
:ascii: 'cl
:type: verb
#1 Ceiling
round up Î±. scalar.
> :3.1âŒ  â‰¡ 4
> :3.9âŒ  â‰¡ 4
>    4âŒ  â‰¡ 4
see also: ||Floor||, ||Round||, ||Euclidean Division||
#2 Shift Right
returns a list of the same length as Î±, with every item shifted to the right by Î², using the fill of Î± to fill the blanks. Î²-pervasive.
> 12345678âŒ 3 â‰¡ â– â– â– 12345
> 87654321â–0âŒ 5 â‰¡ 00000876â–0
> "yeah!!!"â–` âŒ 4 â‰¡ "    yea"â–` 
> "yeah!!!"â–` âŒ 2 â‰¡ "  yeah!"â–` 
> (012)(345)(678)â–000âŒ 1 â‰¡ (000)(012)(345)â–000
a negative Î² acts like ||Shift Left||:
> "yeah!!!"â–` âŒ _2 â‰¡ "ah!!!  "â–` 
and if `Î±~â‰¤Î²`, the whole list will be filled:
> 12345678âŒ 8 â‰¡ â– â– â– â– â– â– â– â– 
see also: ||Shift Left||, ||Rotate Right||
---
:char: âŒ¡
:ascii: 'fl
:type: verb
#1 Floor
round down Î±. scalar.
> :3.1âŒ¡ â‰¡ 3
> :3.9âŒ¡ â‰¡ 3
>    4âŒ¡ â‰¡ 4
see also: ||Ceiling||, ||Round||
#2 Shift Left
returns a list of the same length as Î±, with every item shifted to the left by Î², using the fill of Î± to fill the blanks. Î²-pervasive.
> 12345678âŒ¡3 â‰¡ 45678â– â– â– 
> 87654321â–0âŒ¡5 â‰¡ 32100000â–0
> "yeah!!!"â–` âŒ¡4 â‰¡ "!!!    "â–` 
> "yeah!!!"â–` âŒ¡2 â‰¡ "ah!!!  "â–` 
> (012)(345)(678)â–000âŒ¡1 â‰¡ (345)(678)(000)â–000
a negative Î² acts like ||Shift Right||:
> "yeah!!!"â–` âŒ¡_2 â‰¡ "  yeah!"â–` 
and if `Î±~â‰¤Î²`, the whole list will be filled:
> 12345678âŒ¡8 â‰¡ â– â– â– â– â– â– â– â– 
see also: ||Shift Right||, ||Rotate Left||
---
:char: Ã·
:ascii: '%
:type: verb
#1 Round
rounds Î± to the closest integer. may do round-half-to-even rounding. scalar.
> :3.1Ã· â‰¡ 3
> :3.9Ã· â‰¡ 4
>    4Ã· â‰¡ 4
see also: ||Floor||, ||Ceiling||
#2 Euclidean Division
calculates the euclidean division of Î± and Î², which will always be an integer. for positive Î², this is the same as floor division `Î±/Î²âŒ¡`. for any Î± and Î², `Î²*(Î±Ã·Î²) + (Î±%Î²) â‰¡ Î±`.
> :345Ã·Î¦ â‰¡ :34
> :345Ã·:25 â‰¡ :13
> 1Ã·2 â‰¡ 0
> 1Ã·_2 â‰¡ 0
> _1Ã·2 â‰¡ _1
> _1Ã·_2 â‰¡ 1
see also: ||Remainder||, ||Floor||, ||Divide||
---
:char: â‰ˆ
:ascii: '~
:type: verb
#1 Is Empty
returns 1 if the length of Î± is not 0, otherwise 0
> 123â‰ˆ â‰¡ 1
> Ï†â‰ˆ â‰¡ 0
#2 Not Matches
equivalent to `â‰¡Â¬`
> 123â‰ˆ123 â‰¡ 0
> 123â‰ˆ1234 â‰¡ 1
> (+)â‰ˆ(+) â‰¡ 1
see also: ||Matches||
---
:char: Â°
:ascii: 'dg
:type: verb
#1 As Degrees
converts Î± degrees to radians. equivalent to `*â”œÏ€/:180`. scalar.
> 0Â° â‰¡ 0
> :90Â° â‰¡ Ï€Â½
> :180Â° â‰¡ Ï€
> :270Â° â‰¡ 3*Ï€Â½
> :360Â° â‰¡ 2*Ï€
> :69Â°Ã… Â± :69
---
:char: Â¨
:ascii: 'nm
:type: literal
#n Name
the identifier `name` as a string.
> Â¨bee â‰¡ "bee"
> Â¨thingsÂ¨wordsÂ¨concepts â‰¡ "things""words""concepts"
---
:char: Â·
:ascii: '&
:type: statement
#aÂ· Discard
statement that discards the value `a` and continues with the function or program.
> 0{4Â·5Â·6} â‰¡ 6
see also: ||Return||
---
:char: âˆš
:ascii: 'V
:type: verb
#1 Square Root
calculate the square root of Î±. scalar.
> 2âˆš â‰¡ :1.4142135623730951
> :1:4:9:16âˆš â‰¡ 1234
#2 Root
calculate the Î²th root of Î±. scalar.
> 2âˆš3^3 â‰¡ 2
---
:char: â¿
:ascii: 'n, 'ft
:type: verb
#1 Default Format
format Î± with default settings. equivalent to `â¿1`
> :123â¿ â‰¡ "123"
> 123â¿ â‰¡ "(1 2 3)"
#2 Format
when this is called with a right argument, it will be interpreted in the following way:
- 0: format for printing (see ||Execution||)
- 1: default format
- 2: integer
- 3: Unicode character
- 4: Unicode string
- 5: codepage string
- 7: line-separated list
- 8: left-aligned list of lists
- 9: right-aligned list of lists
you can also use multiple of these in a list, like `â¿74` (line-separated list of strings)
`8` and `9` are useful for neatly formatted tables:
>     )9 :99â†‘44Ã¡
> ((13  4  6 26)
>  (53  7 18 72)
>  (54 45 84 87)
>  (36 41 13 60))
---
:char: Â²
:ascii: 'z, 'sq
:type: verb
#1 Square
equivalent to `^2`. scalar.
> 4Â² â‰¡ :16
> 0Â² â‰¡ 0
#2 Binomial Coefficient
calculate the binomial coefficient `Î± choose Î²`. scalar.
> 4Â²012345 â‰¡ 146410
---
:char: â– 
:ascii: 'N
:type: noun
#0 None
none, null, nil, NaN. used as a dummy value sometimes.
see also: ||Is None||, ||Is Some||, ||Fill Holes||, ||Replace Holes||, ||Filter Holes||, ||Nullify||
---
:char: â••
:ascii: '"
:type: 1-adverb
#1a1 Each
call G with each item in Î±.
> 123â••â–² â‰¡ 234
> 123â••(,0) â‰¡ (10)(20)(30)
> (123)(456)(789)â••â™  â‰¡ (321)(654)(987)
if Î± has a non-null fill, G is called to the fill as well:
> 01001â–0Â¬ â‰¡ 10110â–1
#2a1 Each
Each (along with its variants) is the main way of doing iteration in vemf. scalar functions (like ||Add|| or ||Minimum||) all use ||Conform||, which is similar to ||Each||, so all of this will apply to those functions as well.
> 123â••+456 â‰¡ 123+456
if both Î± and Î² are lists, pair the items up and call G between them.
> 123+456 â‰¡ (1+4)(2+5)(3+6)
> "abc"â••,"xyz" â‰¡ "ax""by""cz"
> 123*456 â‰¡ :4:10:18
if all non-scalar arguments have non-null fill, G is called with the fills as well:
> 0123â–0+1 â‰¡ 1234â–1
> 2315103â–4*(1021100â–2) â‰¡ 2025100â–8
when two lists have different lengths, the shorter list will use its fill to fill up the missing elements:
> 123+45 â‰¡ 57â– 
> 123+(45â–0) â‰¡ 573
> 567+01234 â‰¡ 579â– â– 
> 567â–0+01234 â‰¡ 57934
> 567â–1+01234 â‰¡ 57945
> 567â–1+01234 â‰¡ 57945
if any argument is a scalar, it will be copied in each iteration (or equivalently, it is extended to the other argument's shape):
> 123â••,0 â‰¡ â”‚10â”‚20â”‚30
> 1234â••{Î±â¿;`#} â‰¡ "#1""#2""#3""#4"
> 1234Âªâ••(;`#) â‰¡ "#1""#2""#3""#4"
> 1234Âªâ••;`# â‰¡ "#1""#2""#3""#4"
if both arguments are scalars, it just applies the operation on them
> 1â••,2 â‰¡ 12
if any of the arguments is a function, it treats it as an infinite list, composing the operation to it:
> .â—„+1â†‘Î¦ â‰¡ 123456789Î¦
> .â—„*(Ã³2)â†‘Î¦ â‰¡ 0020406080
Each applies only to one level of nesting, unlike ||Conform||:
> (â”‚01â”‚23)(â”‚45â”‚67)(89),0 â‰¡     (â”‚01â”‚23)(â”‚45â”‚67)(89)0
> (â”‚01â”‚23)(â”‚45â”‚67)(89)â••,0 â‰¡    (â”‚01â”‚230)(â”‚45â”‚670)(890)
> (â”‚01â”‚23)(â”‚45â”‚67)(89)â••â••,0 â‰¡   (â”œ010â”œ230)(â”œ450â”œ670)(â”‚80â”‚90)
> (â”‚01â”‚23)(â”‚45â”‚67)(89)â••â••â••,0 â‰¡  (â”‚â”‚00â”‚10â”‚â”‚20â”‚30)(â”‚â”‚40â”‚50â”‚â”‚60â”‚70)(â”‚80â”‚90)
> (â”‚01â”‚23)(â”‚45â”‚67)(89)â••â••â••â••,0 â‰¡ (â”‚â”‚00â”‚10â”‚â”‚20â”‚30)(â”‚â”‚40â”‚50â”‚â”‚60â”‚70)(â”‚80â”‚90)
> (â”‚01â”‚23)(â”‚45â”‚67)(89)_â••,0   â‰¡ (â”‚â”‚00â”‚10â”‚â”‚20â”‚30)(â”‚â”‚40â”‚50â”‚â”‚60â”‚70)(â”‚80â”‚90)
see also: ||Each Left||, ||Each Right||, ||Conform||
#_1a1 Conform
call F to every scalar in Î±, keeping the list's structure. this is similar to ||Each|| called arbitrarily many times.
> (â”‚01â”‚23)(â”‚45â”‚67)(89)â–² â‰¡ (â”‚12â”‚34)(â”‚56â”‚78)(9Î¦)
> (â”‚01â”‚23)(â”‚45â”‚67)(89) _â••(,0) â‰¡ (â”‚â”‚00â”‚10â”‚â”‚20â”‚30)(â”‚â”‚40â”‚50â”‚â”‚60â”‚70)(â”‚80â”‚90)
#_2a1 Conform
apply a function to every scalar in Î± and Î², following the same rules as ||Each||, recursively.
> 0(123)(456)(789) _â••+ 0(123)(12)1 â‰¡ 0(246)(57â– )(89Î¦)
> (â”‚01â”‚23)(â”‚45â”‚67)(89) _â••, 0 â‰¡ (â”‚â”‚00â”‚10â”‚â”‚20â”‚30)(â”‚â”‚40â”‚50â”‚â”‚60â”‚70)(â”‚80â”‚90)
> 123_â••,456 â‰¡ (14)(25)(36)
> 123(45)6 _â••, 6789 â‰¡ (16)(27)(38)(â”‚49â”‚59)(6â– )
---
:char: â•’
:ascii: 'et
:type: 1-adverb
#a1 Each Trim
similar to ||Each||, but instead of extending the shorter list to fit, it will clip the longer list to match the shorter one. the resulting list will always have ||None|| fill.
> 123â•’+45 â‰¡ 57
> 12â•’+345 â‰¡ 46
> 12â–6â•’+(345â–7) â‰¡ 46
this also means it is useful with functions, taking as many items as needed:
> 3245â•’*(â”´^Î¦) â‰¡ :3:20:400:5000
> 01101010â•’*.â—„ â‰¡ 01204060
---
:char: â•›
:ascii: '}
:type: 1-adverb
#2a1 Each Left
iterates through Î±, passing Î² in each iteration
> 123â•›â™«456 â‰¡ (1â”œ456)(2â”œ456)(3â”œ456)
> 123â•›;1 â‰¡ (11)(12)(13)
see also: ||Each Right||
#1a1 Each Left
monadically, this is the same as ||Each||:
> 123â•›; â‰¡ (11)(22)(33)
#_2a1 Extend
call G to every scalar in Î±, keeping the list's structure, while passing Î² in each iteration.
> (123)(45)6 _â•›, 78 â‰¡ (â”œ178â”œ278â”œ378)(â”œ478â”œ578)â”œ678
see also: ||Extend Right||
#_1a1 Extend
monadically, it is the same as ||Conform||:
> (123)(45)6 _â•›â™« â‰¡ (â™ª1â™ª2â™ª3)(â™ª4â™ª5)â™ª6
---
:char: â•˜
:ascii: '{
:type: 1-adverb
#2a1 Each Right
iterates through Î², passing Î± in each iteration
> 123â•˜â™«456 â‰¡ (â”œ1234)(â”œ1235)(â”œ1236)
see also: ||Each Left||
#1a1 Each Right
monadically, it acts like `â”´â•˜f`; iterates through Î±, passing it in each iteration
> 123â•˜* â‰¡ ((123)(246)(369))
> 123â•˜â•›, â‰¡ (â”‚11â”‚21â”‚31)(â”‚12â”‚22â”‚32)(â”‚13â”‚23â”‚33)
#_2a1 Extend Right
call G to every scalar in Î², keeping the list's structure, while passing Î± in each iteration.
> 78 _â•˜, (123)(45)6 â‰¡ (â”œ781â”œ782â”œ783)(â”œ784â”œ785)â”œ786
see also: ||Extend||
#_1a1 Extend
monadically, this is equivalent to `Î±_â•˜GÎ±`:
> (123)4 _â•˜, â‰¡ ( (â”œ12341) (â”œ12342) (â”œ12343) ) (â”œ12344)
---
:char: â•¤
:ascii: '\
:type: 1-adverb
#1a1 Scan
||Reduce||, but keeping the intermediate results. the first element will be left unchanged.
> 12345â•¤+ â‰¡ :1:3:6:10:15
> 12345â•¤, â‰¡ 1(12)(123)(1234)(12345)
#2a1 Seeded Scan
give an element to start with.
> 12345â•¤+1 â‰¡ :2:4:7:11:16
---
:char: â•§
:ascii: '/
:type: 1-adverb
#1a1 Reduce
apply a dyadic operation over the elements a list, left to right, progressively building up a value.
this can be thought of as inserting the function between every element:
> 12345â•§â™« â‰¡ (((12)3)4)5
> 1â™«2â™«3â™«4â™«5 â‰¡ (((12)3)4)5
the ||Sum|| of a list is Reduce Add:
> 12345â•§+   â‰¡ :15
> 1+2+3+4+5 â‰¡ :15
> 12345+    â‰¡ :15
> 1234â•§* â‰¡ :24
you can fold starting from the right (as in `foldr` in haskell) with ||Reverse|| and ||Swap/Selfie||:
> 12345â™ â•§â”´â™« â‰¡ 1(2(3(45)))
an empty list will yield null. a one element list (or a scalar) will return itself.
> Ï†â•§+ â‰¡ â– 
> â™ª8â•§+ â‰¡ 8
see also: ||Scan||
#2a1 Seeded Reduce
gives an element to start with. `Î±â•§fÎ²` is always `Î±âŒÎ²â•§f`. this also means the empty list will return `Î²`; in fact, this is how ||Sum|| and ||Product|| are implemented.
> 12345â•§+0 â‰¡ :15
> Ï†â•§+0 â‰¡ 0
---
:char: â”¬
:ascii: '|
:type: 1-adverb
#1a1 Filter
call G to all elements of Î±, and return the list including only the items that returned a non-zero value. equivalent to `(â•›GâŒ)â•“â€¼` or `Î±â•›GâŒâ€¼Î±`
> 2370236075060501070613â”¬(<3) â‰¡ 20200001001
> "Sample text was first invented by James Sample in 1894."â”¬(â‰¥"a{"+~1) â‰¡ "S      J S  1894."
see also: ||Replicate||, ||Power||
#1a2 Filter
bind Î² to G
> 2370236075060501070613â”¬<3 â‰¡ 20200001001
---
:char: â”´
:ascii: '`
:type: 1-adverb
#1a1 Selfie
equivalent to `Î±GÎ±`
> 5+5 â‰¡ 5â”´+
#2a1 Swap
equivalent to `Î²GÎ±`
> 1/4 â‰¡ 4â”´/1
---
:char: â”
:ascii: 'tl
:type: 1-adverb
#a1 To Left
executes G with the left argument, ignoring the right argument. equivalent to `(â—„G)`.
> 3â–²   â‰¡ 4
> 3â”â–²  â‰¡ 4
> 3â”â–²7 â‰¡ 4
---
:char: â”Œ
:ascii: 'tr
:type: 1-adverb
#a1 To Right
executes G with the right argument, or the left argument if not given. equivalent to `(â–ºG)`.
> 3â–²   â‰¡ 4
> 3â”Œâ–²  â‰¡ 4
> 3â”Œâ–²4 â‰¡ 5
---
:char: â”¼
:ascii: 'fp
:type: 1-adverb
#1a1 Fix Point
execute G repeatedly until the value stops changing. equivalent to `â‰¡_â•©`
> 1â”¼(/â–²) â‰¡ 5âˆšâ–²Â½  ' golden ratio
see also: ||Until Compare||
---
:char: â•ª
:ascii: 's2
:type: 1-adverb
#1a1 Scan Pairs
run F through 2-item pairs of Î±, passing the left item as the left argument and the right item as the right argument. the first item will be left unchanged.
> 12345 â•ª+ â‰¡ 13579
> 23456 â•ª+1 â‰¡ 3579:11
#2a1 Scan Pairs
run F through 2-item pairs of Î±, passing the left item as the left argument and the right item as the right argument. Î² will be passed as the left item to the first item of the result.
> 12345 â•ªâ™« â‰¡ 1(12)(23)(34)(45)
> 12345 â•ªâ™«0 â‰¡ (01)(12)(23)(34)(45)
---
:char: â•¬
:ascii: 'vl
:type: 2-adverb
#1a2 Valences
call F.
> 1{"monad ",â”‚Î±â¿}â•¬{"dyad ",â”‚Î±â¿,` ,â”‚Î²â¿} â‰¡ "monad 1"
> 1â– â•¬â–º  â‰¡ â– 
#2a2 Valences
call G.
> 1{"monad ",â”‚Î±â¿}â•¬{"dyad ",â”‚Î±â¿,` ,â”‚Î²â¿}2 â‰¡ "dyad 1 2"
> 1â– â•¬â–º2 â‰¡ 2
---
:char: â•¦
:ascii: 'su
:type: 2-adverb
#1a2 Scan Until
call a function G repeatedly, returning all the different iterations, until F passes. F is passed the current iteration as Î± and the last iteration as Î².
> :100(<5)â•¦Â½ â‰¡ :100:50:25:12.5:6.25:3.125
see also: ||Until||
#2a2 Scan Until
bind Î² to G
#_1a2 Scan Until Compare
call a function G repeatedly, returning all the different iterations, until `Î±GFÎ±` passes: F is passed the current iteration as Î± and the last iteration as Î².
> 1â‰¡_â•¦(/â–²) â†‘:12 *_fâŒ¡/_f â‰¡ :1.000:2.000:1.500:1.666:1.600:1.625:1.615:1.619:1.617:1.618:1.617:1.618
see also: ||Until Compare||
#_2a2 Scan Until Compare
bind Î² to G
---
:char: â•©
:ascii: 'U
:type: 2-adverb
#1a2 Until
call a function G repeatedly, returning the first result where `Î±F` passes.
> :100(<5)â•©Â½ â‰¡ :3.125
> :100(<1)â•©Â½ â‰¡ :0.78125
see also: ||Scan Until||
#2a2 Until
bind Î² to G
#_1a2 Until Compare
call a function G repeatedly, returning the first result where `Î±GFÎ±` passes: F is passed the current iteration as Î± and the last iteration as Î². `â‰¡_â•©` is the same as ||Fix Point||:
> 1â‰¡_â•©(/â–²) â‰¡ 5âˆšâ–²Â½  ' golden ratio
#_2a2 Until Compare
bind Î² to G
---
:char: â•¥
:ascii: 'sp
:type: 2-adverb
#1a2 Scan Power
call a function G repeatedly, `Î±F` times. F will be executed with the arguments. this will return a list of length `Î±f+1`, including the original value.
> :100 7â•¥Â½ â‰¡ :100:50:25:12.5:6.25:3.125:1.5625:0.78125
#2a2 Scan Power
bind Î² to F and G
---
:char: â•¨
:ascii: 'P
:type: 2-adverb
#1a2 Power
call a function G repeatedly, `Î±F` times. F will be executed with the arguments.
> :100 7â•¨Â½ â‰¡ :0.78125
if the result of `Î±F` is a list, repeat each of the elements.
> 123456789 (020110000)â•¨Â¼ â‰¡ 1838Î¦6789
> 1(23)()(4()56)()(89) â‰¡â••â•¨Î˜ â‰¡ 1(23)Î˜(4()56)Î˜(89)
#2a2 Power
bind Î² to F and G
---
:char: â•«
:ascii: 'wn
:type: 2-adverb
#1a2 Scan Windows
apply a function G to each successive slice ("window") of length `Î±F` of the list Î±.
> "things" 3â•«â–º â‰¡ "thi""hin""ing""ngs"
> 0123456 3â•«+ â‰¡ 3:6:9:12:15
for a searched list of length `n` and window length `k`, the number of windows will be `n-k+1Ã‘0` (even for `k=0`):
> "thing"0â•«â–º â‰¡ ()()()()()()
see also: ||Scan Pairs||
#2a2 Power
bind Î² to G
---
:char: â•—
:ascii: 'dr
:type: 2-adverb
#1a2 Drill
return a list `Î±` with an item modified. the function G is run on item `Î±F`.
> (123)(456)(789) Ï†â•—â–² â‰¡ (234)(567)(89Î¦)
> (123)(456)(789) 0â•—â–² â‰¡ (234)(456)(789)
> "x../xo./..o"(#`.)â•—`x â‰¡ "xx./xo./..o"
if the result of `Î±F` is a list, it can modify items deep in a nested list:
> (123)(456)(789) (12)â•—â–² â‰¡ (123)(457)(789)
#2a2 Drill
bind Î² to F
---
:char: â•”
:ascii: 'am
:type: 2-adverb
#1a2 Amend
return a list where the items at indices `Î±F` are modified by `G`.
> "hello world"(46789)â•”Ã‡ â‰¡ "hellO WORLd"
the whole list of the items to be modified is passed to G (`Î±Â¿(Î±F)G`) and its result is used to replace the items in Î±. this function is useful for modifying sublists (or substrings) in a list:
> "big brown fox"(4â†•9)â•”Â» â‰¡ "big nbrow fox"
> "big brown fox"(4â†•9)â•”(Â«2) â‰¡ "big ownbr fox"
> "big brown fox"(4â†•9)â•”"green" â‰¡ "big green fox"
> 0123456789(3â†¨7)â•”â–² â‰¡ 0124567889
but there's no requirement that `Î±F` is contiguous, or in order:
> ". . . . . "(723904)â•”"cheese" â‰¡ "s hee .c.e"
> 0123456789(681942)â•”â–¼ â‰¡ 0013355778
if the result list from G is shorter than `Î±F`, the last indices will be removed from the list:
> "big brown fox"(4â†•9)â•”"blue" â‰¡ "big blue fox"
> 0248Î¦(124)â•”Ï† â‰¡ 08
and if the result list from G is longer than `Î±F`, the last values will be inserted after the last one:
> "big brown fox"(4â†•9)â•”(â€¼2) â‰¡ "big bbrroowwnn fox"
#2a2 Amend
bind Î² to F and G
---
:char: â•œ
:ascii: ')
:type: 2-adverb
#1a2 At Left
equivalent to `Î±FG`.
#2a2 At Left
equivalent to `Î±FGÎ²`.
#_a2 Atop
adverb form of atop, same as the 2-train `FG`. `Î±F_â•œG` is equivalent to `Î±FG`, and `Î±F_â•œGÎ²` is equivalent to `Î±FÎ²G`. useful when composing functions tacitly.
see also: ||Trains||
---
:char: â•™
:ascii: '(
:type: 2-adverb
#1a2 At Right
equivalent to `aG`.
#2a2 At Right
equivalent to `Î±G(Î²F)`.
#_a2 Bind
adverb form of bind. same as the train `Gf`, where `f` is F interpreted as a noun, (or rather, `.F`). note that the arguments are reversed. `Î±f_â•™G` and `Î±f_â•™GÎ²` are equivalent to `Î±Gf`; this ignores the second operand. useful when composing functions tacitly.
see also: ||Trains||
---
:char: â•–
:ascii: ']
:type: 2-adverb
#1a2 On Left
equivalent to `Î±FGÎ±`.
#2a2 On Left
equivalent to `Î±FÎ²GÎ²`.
---
:char: â•“
:ascii: '[
:type: 2-adverb
#1a2 On Right
equivalent to `Î±G(Î±F)`.
#2a2 On Right
equivalent to `Î±G(Î±FÎ²)`.
---
:char: â•‘
:ascii: 'ov
:type: 2-adverb
#1a2 Over
equivalent to `Î±FG`.
#2a2 Over
equivalent to `Î±FG(Î²F)`.
---
:char: â””
:ascii: 'K
:type: grammar
#Î±â””FGH Fork
equivalent to `Î±FG(Î±H)`.
#Î±â””FGHÎ² Fork
equivalent to `Î±FÎ²G(Î±HÎ²)`.
---
:char: â”€
:ascii: 'st
:type: grammar
#Î±â”€name Set Function
set a local variable `.name` to the value Î±. similar to `â†’name` ||Set|| but acts as a function.
> 2â”€twoÂ· .two+.two â‰¡ 4
after setting, it returns Î±. you can assign a function and use it right after:
> 2â”€two+.two â‰¡ 4
the uppercase ascii letters `A` `B` `C`... are assigned to be `â”€a` `â”€b` `â”€c` by default. this makes for a very convenient way of setting and querying variables:
> 2T+t â‰¡ 4  ' Î±T sets Î± to the variable `t` and returns Î±
this function is special in that, when used as a verb and called with two arguments, the right argument will be interpreted after the variable is set. this allows for code like this:
> 1A 2B (ab)+ â‰¡ 3
even if `(ab)` is an argument of `B`, and would logically other functions evaluate their arguments before calling them.
#Î±â”€nameÎ² Set Function
sets a variable to Î± in the local scope and returns Î².
> 1â”€a2â”€b3â”€c a+b+c â‰¡ 6
> 1A2B3C +a+b â‰¡ 6
see also: ||Mutate Function||, ||Set||
---
:char: â•
:ascii: 'mt
:type: grammar
#aâ•name Mutate Function
change the variable `.name` using the function Î². similar `â†”name` ||Mutate|| but acts as a function. returns the changed value.
> 1â†’a .â–²â•aÂ· a â‰¡ 2
> 1â†’a .â–²â•a+a â‰¡ 4
#Î±â•nameÎ² Mutate Function
call the function with Î² as a right argument
> 1â†’a .+â•a2Â· a â‰¡ 3
see also: ||Set Function||, ||Mutate||
---
:char: â”˜
:ascii: '1
:type: grammar
#â”˜m Verbize
turns the following word into a verb. acts as a 1-grouper, see ||Groups||
#.0
the number `1.5`, or `3/2`
#_0
the number `-0.5`, or `Î˜Â½`
---
:char: â”‚
:ascii: '2
:type: grouper
#â”‚mn 2-Group
see ||Groups||
#.0
the number `0.6666666666666666`, or `2/3`
#_0
the number `1.4142135623730951`, or `2âˆš`
---
:char: â”œ
:ascii: '3
:type: grouper
#â”œmno 3-Group
see ||Groups||
#.0
the number `0.3333333333333333`, or `1/3`
#_0
the number `1.7320508075688772`, or `3âˆš`
---
:char: â•ž
:ascii: '4
:type: grouper
#â•žmnop 4-Group
see ||Groups||
#.0
the number `0.25`, or `1/4`
#_0
the number `420`
---
:char: â•Ÿ
:ascii: '5
:type: grouper
#â•Ÿmnopq 5-Group
see ||Groups||
#.0
the number `0.75`, or `3/4`
#_0
the number `2.23606797749979`, `5âˆš`
---
:char: â• 
:ascii: '6
:type: grouper
#â• mnopqr 6-Group
see ||Groups||
#.0
the number `0.16666666666666666`, or `1/6`
#_0
the number `360`
---
:char: â”¤
:ascii: '7
:type: grouper
#â”¤mnopqrs 7-Group
see ||Groups||
#.0
the number `0.14285714285714285`, or `1/7`
#_0
the number `273.15`
---
:char: â•¡
:ascii: '8
:type: grouper
#â•¡mnopqrst 8-Group
see ||Groups||
#.0
the number `0.125`, or `1/8`
---
:char: â•¢
:ascii: '9
:type: grouper
#â•¢mnopqrstu 9-Group
see ||Groups||
#.0
the number `0.1111111111111111`, or `1/9`
---
:char: â•£
:ascii: '0
:type: grouper
#â•£mnopqrstuv 10-Group
see ||Groups||
#.0
the number `2.5`, or `5/2`